{"types.funct": 0, "request.tool_choice.function.nam": 1, "bt.w": 2, "ncclreduc": 3, "glm4vimagepixelinput": 4, "100us": 5, "c.group": 6, "xdim": 7, "sequencegroup.": 8, "minicpmo_26": 9, "graph.upd": 10, "api-refer": 11, "stubmistraltoken": 12, "num_heads_k.": 13, "self.heartbeat_socket.bind": 14, "specialtokens.begin": 15, "non-diagon": 16, "responsewebsearchcallinprogressev": 17, "scaled_qk": 18, "cudatoolkit": 19, "nvmldevicegetnumfan": 20, "shared_kv_cache_layers.key": 21, "self.append_row": 22, "asserts.": 23, "int_fp4": 24, "self.config.mamba_n_head": 25, "chunked_context_metadata.seq_len": 26, "nvml_bridge_chip_plx": 27, "eagle-vicuna-33b-v1.3": 28, "truncate_prompt_token": 29, "self.tool_call_start_token": 30, "h_attn_interfac": 31, "claimnam": 32, "experts.gate_up_proj": 33, "use_fp8_scal": 34, "count.remot": 35, "log_config": 36, "reconstructor.append": 37, "self._embedding_scor": 38, "layer.q": 39, "score.s": 40, "group.to_be_finish": 41, "k_vec": 42, "ids.ndim": 43, "rocm-cor": 44, "self.dummy_api_key": 45, "queue.ful": 46, "type.fixed_s": 47, "lora_linear": 48, "number-of-gp": 49, "stride_vn": 50, "timer.spin": 51, "nvml_fi_dev_nvlink_get_st": 52, "request_keyword_arg": 53, "lora_logits.reshap": 54, "kv_cache_spec.sliding_window": 55, "self.block_shap": 56, "self.hidden_states.dtyp": 57, "flash_attn": 58, "engineembedsprompt": 59, "decode_metadata.max_seq_len_int": 60, "self.compute_logit": 61, "self._process_model_output": 62, "lib.cudaipcgetmemhandl": 63, "_schedule_chunked_prefil": 64, "weight_quant.actord": 65, "env_value.split": 66, "b.block_hash": 67, "triton_m": 68, "std_": 69, "a.block_t": 70, "seq_data.prompt_token_id": 71, "neuron_speculation.pi": 72, "self.watermark_block": 73, "contextlib.suppress": 74, "bart-large-cnn.": 75, "vllm_logging_config_path.": 76, "decode_query.contigu": 77, "self.quant_config": 78, "test_right_side_trunc": 79, "utilization.pi": 80, "prec": 81, "openai_api_serv": 82, "_run_incremental_decod": 83, "tarsier-7b": 84, "update_eagle3": 85, "split_weight": 86, "self.llm_engine.step": 87, "attn_fwd": 88, "rgument": 89, "batch.t": 90, "use_qq_bia": 91, "environment_variables.key": 92, "e.custom_routing_funct": 93, "prompt_path_encod": 94, "nvml_memory_error_type_uncorrect": 95, "mind.": 96, "histogram": 97, "2d.contigu": 98, "_moe_c.abi3.so": 99, "graph_index": 100, "args.append": 101, "llama-3.2-1b-instruct": 102, "samplingtype.random_se": 103, "size.height": 104, "b_meta": 105, "pretrainedconfig": 106, "self.post_attention_layernorm": 107, "imports.py.": 108, "trailing_dim": 109, "self.language_model.get_input": 110, "turn.json": 111, "wr": 112, "prebuilt": 113, "emb_w": 114, "vllm.multimodal.parse.multimodaldataitem": 115, "messages.append": 116, "engine_core_outputs.valu": 117, "check_port": 118, "decode_cudagraph_batch_s": 119, "has_attn": 120, "attn_metadata_builder_cl": 121, "args.eagle_dir": 122, "output.model_validate_json": 123, "run_advanced_demo": 124, "cache_kv_c": 125, "hpu": 126, "sentencesplitt": 127, ".vlm_utils.typ": 128, "copy.extend": 129, "encoder_inputs_to_schedule.append": 130, "speculativeconfig": 131, "query.view": 132, "self.up": 133, "model_info.tokenizer_mod": 134, "config.projector_hidden_s": 135, "workspace13": 136, "get_messag": 137, "l133": 138, "self.cpu_offload_gb": 139, "node.children": 140, "abspath.return": 141, "glm4_moe_tool_parser.extract_tool_calls_stream": 142, "vllm.config.poolerconfig": 143, "test_mp_reduc": 144, "site_dir": 145, "self.stop_token_id": 146, "tokenizer_.vocab": 147, "nvmlpciinfoext_v1_t": 148, ".deepep_ht_prepare_fin": 149, "parsed_args.compilation_config": 150, "out_slic": 151, "add_residu": 152, "qkv_linear.weight.data.cpu": 153, "backrefer": 154, "prefill_idx": 155, "log_record.nam": 156, "i.to_byt": 157, "fe4m3fn": 158, "speculation_config.num_speculative_token": 159, "list_v1_t": 160, "eagle-checkpoint-compat": 161, "self._batcher_tasks.append": 162, "_read_requir": 163, "chatcompletionstreamrespons": 164, "mlacommonmetadatabuild": 165, "self._register_add_request": 166, "_create_block": 167, "interpol": 168, "coordin": 169, "self.query_layernorm": 170, "audio_padding_emb": 171, "vllm.v1.attention.backends.triton_attn.triton": 172, "world_dp_siz": 173, "combined_too_long": 174, "inductor.output": 175, "self.idx": 176, "tree_attn_v1": 177, "reporting.": 178, "args.m_const": 179, "tpuacceleratormanager.get_current_node_num_acceler": 180, "prefill_wrapper._logits_soft_cap": 181, "engines_thread.start": 182, "block_table.block_table_np": 183, "smt-8": 184, "disk.": 185, "vllm.sampling_param": 186, "patterns.append": 187, "received_1": 188, "bitblas_matmul.config.with_zero": 189, "sp.output_kind": 190, "attn.qkv.": 191, "maxspe": 192, "maybe_randomize_input": 193, "config_class.from_pretrain": 194, "fp8-opt-125m": 195, "endpoint": 196, "attn_metadata.decode.paged_kv_last_page_len": 197, "torch.st": 198, "reasoning.encrypted_cont": 199, "prithvigeosaptialma": 200, "gguf.ggml_quant_s": 201, "value_tensor": 202, "nvml_fi_dev_nvlink_count_fec_history_14": 203, "model_info.check_available_onlin": 204, "group_pack_index.devic": 205, "marlin_qqq_weight": 206, "y_q_ptr": 207, "extra_decode_arg": 208, "attention_interfac": 209, "bia": 210, "node.attr": 211, "ributed.get_rank": 212, "layer.w2_weight_scale.dim": 213, "minicpm-s-1b-sft.": 214, "merged_layer_spec.num_kv_head": 215, "falcon-11b": 216, "tests.kernels.allclos": 217, "cases.append": 218, "valclassmapping.get": 219, "refactor": 220, "grow": 221, "mqenginedeaderror.": 222, "enable_eplb": 223, "attrs.get": 224, "column-vector": 225, "_layer": 226, "tokenized_length": 227, "arrival_tim": 228, "clipvisiontransform": 229, "qwen2.5": 230, "first_prompt": 231, ".audio_and_sample_r": 232, "get_pipeline_model_parallel_group": 233, "extract_compiled_index": 234, "get_flash_mla_metadata": 235, "self.engine_client.encod": 236, "summary-nightly-results.pi": 237, ".feed_forward.gate_proj.weight": 238, "types0": 239, "test_get_vllm_port_invalid": 240, "pos_embed.dtyp": 241, "serial": 242, "num_blocks_per_large_til": 243, "nvs": 244, "parallelism.": 245, "poi": 246, "test_flashinfer_trtllm_decode_with_baselin": 247, "spam.": 248, "batch_update_builder.added.extend": 249, "glb": 250, "max_seq_grou": 251, "engprofil": 252, "0.0134": 253, "asyncio.task": 254, "step3textattent": 255, "image_pixel_values.to": 256, "gemma-3n-e4b-it": 257, "jvaqu": 258, "v2for": 259, "vllm-0": 260, "hf_overrides.upd": 261, "self.labelname_max_lora": 262, "cos.unsqueez": 263, "worker.backend": 264, "glm4_moe_tool_parser.prev_tool_call_arr": 265, "--mamba-ssm-cache-dtyp": 266, "idefics3multimodalprocessor": 267, "positions_with_offset": 268, "nvmlvgpuinstancegetmetadata": 269, "gemma3n_mm.pi": 270, "2302.01318": 271, "self.tokenizer.bos_token_id": 272, "mamba1attentionmetadatabuild": 273, "setup_device_if_necessari": 274, "ble_sleep_mod": 275, "--structured-output-ratio": 276, "layer.output_slic": 277, "prime": 278, "punicawrappercpu": 279, "self.attn_group": 280, "variable.": 281, "charset": 282, "ttft": 283, "reduced-lay": 284, "2024.vllm.ai": 285, "maxunavailablepoddisruptionbudget": 286, "fusedexpert": 287, "grid_placehold": 288, "f.grid_sampl": 289, "load-balanc": 290, "raydistributedexecutor": 291, "block_config": 292, "nvmlvgpuinstancegetencodersess": 293, "binary.": 294, "_process_engine_step": 295, "mock_request": 296, "triton_kernels.swiglu.precisionconfig": 297, "files.": 298, "padded.transpos": 299, "quant_stag": 300, "vllm-batch-3580bf4d4ae54d52b67eee266a6eab20": 301, "bugaevc": 302, "f.log": 303, "torch.profiler.profileractivity.xpu": 304, "image.command": 305, "vllm.multimodal.inputs.basemultimodalfield.reduc": 306, "plamo2attentionmix": 307, "config1": 308, "mel_spec": 309, "compressedtensorskvcachemethod": 310, "mm_pars": 311, "_compute_lora_input": 312, "current_hard": 313, "w_coords.to": 314, "torch_scal": 315, "check_logprobs_clos": 316, "test_dispatch": 317, "ovi": 318, "self.time_per_output_tokens_it": 319, "extrem": 320, "_init_pooler_config": 321, "img_tkn_chr_map": 322, "prompt_lora": 323, "vreg": 324, "model_info.matryoshka_dimens": 325, "indptr.extend": 326, "pynccl1": 327, "encountered.": 328, "bias.strid": 329, "static_fp8": 330, "904.0": 331, "chunk_size_train_eff": 332, "against.": 333, "api.login": 334, "return_tokens_as_token_id": 335, "self.tokens_list": 336, "group.encod": 337, "self.model_config.enforce_eag": 338, "ovisprocessor.__call__": 339, "tpu_worker.pi": 340, "compilation_cases_decod": 341, "openaiservingrespons": 342, "forward_return": 343, "self.transformer.make_empty_intermediate_tensor": 344, "c_violtim": 345, "otel": 346, "w13_g_idx_sort_indic": 347, "loadconfig.load_format": 348, "full_spec.use_mla": 349, "setup": 350, "config.max_model_len": 351, "old_block_set": 352, "_apply_gguf_embedding_fak": 353, "spatial_avg_pool_x": 354, "head_index": 355, "mockengin": 356, "masked_gates_top2": 357, "self.buffer.rot": 358, "rot.co": 359, "opencv": 360, "model_pair.model_gptq": 361, "buffer.simpl": 362, "image_gener": 363, "recv.pi": 364, "_get_stat": 365, "mlp_specul": 366, "comm_id": 367, "24gb": 368, "self.has_new_request": 369, "use1": 370, "triton_cach": 371, "worker.schedul": 372, "test_download_weights_from_hf": 373, "blocksd": 374, "block.__init__": 375, "test_tensor_schema_variable_patch_counts_valid": 376, "c_key": 377, "stripe": 378, "marlin_permute_scales_24": 379, "processor.im": 380, "_gen_lora_extra_hash_key": 381, "self._init_model": 382, "load_column_parallel_weight": 383, "torch_level": 384, "self.beta_slow": 385, "stablelm-3b-4e1t": 386, "self.cutlass": 387, "requestfuncinput": 388, "original_image_numpi": 389, "float": 390, "g_shape": 391, "atm": 392, "layer.w13_bias.data.to": 393, "retrieve_process": 394, "self._append_token_ids_no_cow": 395, "weight_scale.to": 396, "deepseekmultitokenpredictorlay": 397, "uc": 398, "tpu_chips_per_host_bound": 399, "self.buffer.dispatch": 400, "long_text": 401, "lm.embedding_padding_modul": 402, "config.adapt": 403, "embeddingrequestoutput.from": 404, "resolvers.": 405, "vllm.v1.engine.coordin": 406, "test_profile.pi": 407, "messi": 408, "ng": 409, "finished_req_i": 410, "vecs.": 411, "test_multiple_graphs.pi": 412, "test_prefix_cache_stats_dis": 413, "spgi": 414, "-0.5": 415, "whisper_encoder.layer_norm.": 416, "data_parallel_external_lb": 417, "embed.sum": 418, "max_tokens_by_modality.": 419, "pixel_values_videos.devi": 420, "h_t": 421, "self.logical_replica_count": 422, "k_buffer.view": 423, "laugh": 424, "seq0": 425, "sql_adapt": 426, "self.quant_block_shap": 427, "tests.v1.attention.test": 428, "storage.": 429, "vllm_model.llm.llm_engine.token": 430, "seq_group_meta.encoder_seq_data": 431, "nisa.nc_transpos": 432, "prefill_done.set": 433, "out_smem": 434, "apiserv": 435, "build_output": 436, "test_flashinfer_fallback": 437, "unset_fake_temporarili": 438, "current_platform.get_punica_wrapp": 439, "self._listener_thread.join": 440, "symbol.": 441, "data.previ": 442, "vllm_config.model_config.hf_config.partial_rotary_factor": 443, "dst_kv_cache_lay": 444, "self._convert_msgspec_arg": 445, "purposes.": 446, "bigbuckbunny.mp4": 447, "adm1032": 448, "unique_schedul": 449, "layer.logit": 450, "pixel_values_videos_lst.append": 451, "mprompt": 452, "output.prompt_token_id": 453, "xt.": 454, "vllm-v0": 455, "openai.internalservererror": 456, "hidden_states.kv_connector_output": 457, "_nvmldevicegpurecoveryaction_t": 458, "to_seria": 459, "self.tokenizer.image_end_tag": 460, "pptestopt": 461, "dure": 462, "customenum": 463, "self.kv_cache_quantized_dtyp": 464, "nvml_volatile_ecc": 465, "vllm.model_executor.layers.quantization.kernels.mixed_precision.dynamic_4bit": 466, "linear.out_featur": 467, "scale_b.t": 468, "w1_fp8q_notransp": 469, "test_w8a8_block_int8_matmul": 470, "fp8.shape": 471, "info.singl": 472, "scatter_idx": 473, "vllm.config.load": 474, "transformers.models.whisper.model": 475, "metadata.contex": 476, "self.engine.get_scheduler_config": 477, "mm-processing-test": 478, "customiz": 479, "deepseek_v2.pi": 480, "_send_input_messag": 481, "patches_subgrid": 482, "icao": 483, ".abstract": 484, "processes.": 485, "bld": 486, "mean_itl_m": 487, "sql-lora": 488, "self._prepare_weight": 489, "default_server_args.append": 490, "call": 491, "case.get": 492, "split.gat": 493, "num_video_fram": 494, "sentence_roberta_config.json": 495, "--max-lora-rank": 496, "cv2.cvt": 497, "self.boi": 498, "w4a4mx": 499, "thinker_config.text_config": 500, "nvml_device_vgpu_cap_fractional_multi_vgpu": 501, "self.llm.gener": 502, "trace2graph": 503, "replay.pol": 504, "_trace_cal": 505, "self._cache.put": 506, "test_pplx_moe_slow": 507, "async_schedul": 508, "allclos": 509, "self.pd.concat": 510, "send_buf": 511, "request_validator.validate_python": 512, "utils.processors.deepseek": 513, "handler.formatt": 514, ".self_attention.": 515, "self.norm0": 516, "nvml_gpu_instance_profile_2_slice_gfx": 517, "common_attn_metadata.seq_lens_cpu.numpi": 518, "gen_nonoverlapped_sum_from_gputrac": 519, "self.parallel_config.eplb_log_balanced": 520, "qkvo.pack": 521, "is_debug_build": 522, "pass_nam": 523, "new_error_class": 524, "fp8_input.shap": 525, "mk_fused_expert_typ": 526, "cur_tree_choic": 527, "self.wake_up": 528, "wiki": 529, "autom": 530, "gathered_weight": 531, "ar.dispos": 532, "roup_siz": 533, "torch.ops.vllm.fus": 534, "--in_fil": 535, "trn1": 536, "qw.device.index": 537, "underscor": 538, "listen_for_request": 539, "minicpm-v": 540, "pretrainedtokenizer.batch": 541, "config.convert": 542, "wts": 543, "scheduler_outputs.preempt": 544, "llm.shutdown": 545, "self._cleanup_if_necessari": 546, "block_manager.pi": 547, "req_num_token": 548, "nvml_fi_dev_ecc_dbe_agg_cbu": 549, "args.queue_s": 550, "create_load_config": 551, "deseri": 552, "create_request": 553, "internlm2_5-7b-chat": 554, "adopt": 555, "state.begin": 556, "self.cmake_lists_dir": 557, "allocator.clear": 558, "combined_logprobs.append": 559, "00-install-kubernetes-env.md": 560, "collective_rpc_async": 561, "vllm.assets.audio": 562, "validate_al": 563, "mock_engine.add_lora.assert_not_cal": 564, "test_rotary_embed": 565, "layer.get_expert_weight": 566, "ser.extract_tool_calls_stream": 567, "latent": 568, "cache_vari": 569, "sampled_logprobs_dict": 570, "question.low": 571, "gptbigcodeforcausallm": 572, "move.": 573, "ns_detail": 574, "nvmlconfcomputememsizeinfo": 575, "self.batched_hidden_states.s": 576, "training-specif": 577, "chat_utils.pi": 578, "bpe_toks.view": 579, "allocator.cr": 580, "--save-dir": 581, "schedulerconfig.max_long_partial_prefil": 582, "layer.b": 583, "ast.importfrom": 584, "maybe_register_config_serialize_by_valu": 585, "self.seq_id_to_seq_group": 586, "_xfer_buff": 587, "vl-diff-patch": 588, "quarkw8a8fp8.get": 589, ".propos": 590, "inp.element_s": 591, "dtype.is_complex": 592, "nvml_gpu_instance_profile_4_slice_gfx": 593, "qkv_weights.item": 594, "different_hash": 595, "model_id_or_arch": 596, "current_request_r": 597, "proceedings.neurips.cc": 598, "json.get": 599, "layer.cr": 600, "stablelmepochforcausallm": 601, "temporal_avg_pool_x": 602, ".bl": 603, "event.start_tid": 604, "update_ssl_cert_chain": 605, "moe_layer_freq": 606, "update_from_generation_config": 607, "max_n_in_batch": 608, "tttt": 609, "c_pidarray": 610, "batch.generators.get": 611, "positive_probs.cpu": 612, "sky.": 613, "self.model_executor.remove_lora": 614, "cpm-v-2": 615, "self.mrop": 616, "huggingface_hub.constants.repo_id_separator.join": 617, "_protected_step": 618, "config.spatial_pool_mod": 619, "moe.mlp.w13.weight": 620, "self.inf": 621, "arch_to_skip": 622, "get_decoder_dummy_data": 623, "string.digit": 624, "engines.": 625, "itself.": 626, "loop.add": 627, "production.": 628, "manner.": 629, "self.repetition_penalties_cpu_tensor.numpi": 630, "tokenization.": 631, "subscriber.clos": 632, "cached_block": 633, "parser.mm": 634, "is_gat": 635, "docs.txt": 636, "config.num_key_value_head": 637, "rank_weights.w2_scal": 638, "_print_warning_onc": 639, "llama_2_7b_model_extra_embed": 640, "self.has_zp": 641, "passes_for_backend.append": 642, "c.full": 643, "mi325": 644, "vl.": 645, ".values.tolist": 646, "vllm.v1.worker.xpu": 647, "new_config": 648, "non-existent-lora-adapt": 649, "create_all_prompt_typ": 650, "test_mixed_usag": 651, "config.inductor_compile_config": 652, "matric": 653, "from_fil": 654, "hf_config.mamba_d_head": 655, ".pkl": 656, "get_max_thread": 657, "help_text": 658, "mask_bia": 659, "uuid": 660, "minimaxtext01rotaryembed": 661, "self.weight_qschem": 662, "3.295": 663, "outputs_queu": 664, "e.add_not": 665, "states.kv": 666, "actual_expert_id": 667, "app.config.upd": 668, "fp8_traits.max": 669, "unintent": 670, "self._loop.run_in_executor": 671, "torch.ops._c_cache_ops.reshape_and_cach": 672, "test_streaming_tool_cal": 673, "cache_s": 674, "max_concurrent_request": 675, "challeng": 676, "registri": 677, "n_expert": 678, "output.seq": 679, "_preempt_by_recomput": 680, "self.cls_token": 681, "xgrammar.kernels.apply_token_bitmask_inplace_torch_compil": 682, "self.engine_core.reset_mm_cache_async": 683, "sentencepiecetoken": 684, "q_inter_sin": 685, "parser._json_tip": 686, "self.to_out": 687, ".bit": 688, "copy_inputs_before_cuda_graph": 689, "feature-x-hardwar": 690, "higher-precis": 691, "numpy-styl": 692, "chunk_offsets_ptr": 693, "scalartype.": 694, "self.resources.first_req_rcv_socket": 695, "self.mapping_prompt_funcs.get": 696, "arceeforcausallm": 697, "one-pod-per-rank": 698, "accuracy.html": 699, "hit_blocks_other_attn": 700, "req.get": 701, "self.llm_engine.get_model_config": 702, "args.save_result": 703, "dgram": 704, "padded_block_k": 705, "httpstatus.unprocessable_entity.valu": 706, "rand_marlin_weight_nvfp4_lik": 707, "spikes.": 708, "gate_proj": 709, "test_infeasible_swap": 710, "openaimessag": 711, "cuda_stream": 712, "node.target": 713, "test_find_array": 714, "_cc": 715, "asyncschedul": 716, "num_embeddings_pad": 717, "load-bal": 718, "_time_proj_bia": 719, "decode_metadata.paged_kv_indptr": 720, "vllm.compilation.cuda_graph.cudagraphwrapp": 721, "fb.key_to_rank_lidx.key": 722, "self._ready_requests.get_nowait": 723, "9.": 724, "raw_functio": 725, "loader._filter_subtensor": 726, "self.long_short_cos_sin_cach": 727, "routingsimulator._routing_strategi": 728, "target_h": 729, "distinct_llm_kwarg": 730, "layer.w2_weight.s": 731, "australia": 732, "self.channel_attn": 733, "registerfil": 734, "kv_cache_specs_ful": 735, "cur_head_id": 736, "self.encoder_cache.pop": 737, "4.56.0": 738, "pooling_params.verifi": 739, ".residual_mlp": 740, "percentiles.tolist": 741, "args.project_dir": 742, "hit_ratio": 743, "rotary_pos_emb_thw.flatten": 744, "robertamodel": 745, "mistral.model.args.yarn": 746, "col_width": 747, "systemat": 748, "truncation.": 749, "--json-arg.key4": 750, "mambadtyp": 751, ".is_prompt": 752, "seq_tokens.append": 753, "bloomchat": 754, "next_token_ids_gpu": 755, "self._streaming_mask": 756, "test_quant_lm_head_true.pi": 757, "target.get_match_index": 758, "az": 759, "inputs_embeds.masked_scatt": 760, "build_audio_inputs_from_test_info": 761, "empty_fp32": 762, "self.tokenizer.add_special_token": 763, "2307.06304": 764, "rms_gamma": 765, "available_gpus": 766, "self.target_token_id2": 767, "passes.item": 768, "async_tp_en": 769, "config.projector": 770, "any.": 771, "output_len": 772, "expected_runner_typ": 773, "example_dir.resolv": 774, "self.fp32_acc": 775, "d.png": 776, "asyncio.exceptions.timeout": 777, "functool": 778, "obj.data": 779, "_cumulative_cuda_tim": 780, "config.__class__.__name__": 781, "test_rms_norm_dispatch": 782, "config.mamba_d_st": 783, "abs_pos_new": 784, "nan": 785, "scheduler_metadata": 786, "starcoder2attent": 787, "torch_compile.md": 788, "b_s": 789, "---------------------------------------------------------------": 790, "self.merge_kernel_s": 791, "_backend.flash_attn_vllm_v1": 792, "vllm.v1.attention.backends.mla.rocm_aiter_mla.ait": 793, "ctx.encod": 794, "threading.get": 795, "visit_import": 796, "qwen-vl-chat": 797, "new_exp_away": 798, "get_ref_result": 799, "get_image_processor": 800, "values.yaml.": 801, "caplog_vllm.record": 802, "config.clip_qkv": 803, "args.op": 804, "1.26.0": 805, "_log_non_streaming_respons": 806, "_add_adapt": 807, "prefix_ls": 808, "self.activation_dropout": 809, "s.split": 810, "self.top_k_tokens_per_head": 811, "desc": 812, "self.platform": 813, "self._batch_decode_loop": 814, "maybe_get_kv_connector_output": 815, "self.config.decode_url": 816, "a_sf_swizzl": 817, "gate_d.transpos": 818, "fb.close": 819, "quant_result.dtyp": 820, "aitermlaimpl": 821, "self._sampler_indices_padded.to": 822, "a_dq": 823, "inputs.upd": 824, "self._put_impl": 825, "image_processor.image_token_length_w": 826, "torch._inductor.codecache.compiled_fx_graph_hash": 827, "output_bia": 828, "numpy_array": 829, "osit": 830, "batch_embed": 831, "loraresolverregistry.get_supported_resolv": 832, "deepspeedfp": 833, "self._comput": 834, "lowest-prior": 835, "before_cr": 836, "self._model_info.has_noop": 837, "data.clon": 838, "r1v.": 839, "mock_coordinator.clos": 840, "test_eagle.pi": 841, "externaldp": 842, "self.shared_expert_g": 843, "embeds.pi": 844, "enable_code_interpret": 845, "pc2": 846, "input_item": 847, "smt-2": 848, "self.gpt_neox.make_empty_intermediate_tensor": 849, "args.stop_token_id": 850, "3aopen": 851, "w2_blockscale.ndim": 852, "prev_tool_start_count": 853, "slot": 854, "workerwrapp": 855, "test_eviction_alloc_mix": 856, ".sh": 857, "calculate_express": 858, "session.initi": 859, "num_old_physical_expert": 860, "qwen3_reasoning_parser.pi": 861, "randomize_input": 862, "self.moe.has_bia": 863, "proposer.child_drafts_per_level": 864, "gemm1_weights_fp8_shuffl": 865, "unicod": 866, "self.conv1d.weight.view": 867, "self.spec_decoding_logging.log": 868, "runner.num": 869, "cleanup.": 870, "tp8": 871, "test_config_validator.pi": 872, "args.clear": 873, "score.2.": 874, "adjustment.": 875, "commands.": 876, "listen_socket": 877, "tensor_sf.to": 878, "hidden_sizes_tensor": 879, "initialize_kv_cache_for_kv_shar": 880, "target_magnitud": 881, "text-with-imag": 882, "moe.forward": 883, "31.4": 884, "sorted_seq": 885, "integer.": 886, "safetensors.": 887, "decode_metadata.seq_lens_int": 888, "swizzled_scale.contigu": 889, "step3_vl": 890, ".embd_lay": 891, "release_year": 892, "client.add": 893, "musk": 894, "self._compute_lora_input": 895, "vllm_model.llm.emb": 896, "self._get_prefill_wrapp": 897, "affection": 898, "draft_hidden_states.repeat_int": 899, "punica": 900, "self.runner.model": 901, "buffer_coord.seek": 902, "_decoder_attn_setup": 903, "is_ch": 904, "self.long_prefil": 905, "frame.f_code.co_nam": 906, ".eq": 907, "pagedattent": 908, "presets.json": 909, "ected_num_token": 910, "included.": 911, "deo_fram": 912, "_get_and_validate_encoder_len": 913, "oll": 914, "gemma3nimageinput": 915, "full_attn_beta_factor": 916, "octicon-ey": 917, "uant_config": 918, "executor.layers.layernorm.rmsnorm": 919, "modelconfig.hf_config_path": 920, "end_idx_ful": 921, "ariaforconditionalgener": 922, "0.4": 923, "decode_response.choic": 924, "iteration_stats.update_from_finished_request": 925, "mptforcausallm": 926, "more_types_function_output": 927, "int8.half": 928, "fused_moe_wn16_mnk_factor": 929, "engine._add_processed_request": 930, "self._handle_load_adapter_request": 931, "groups.extend": 932, "torch.float8_e4m3fnuz": 933, "forward_stats.sort": 934, "cta_lora_seq_indic": 935, "split_str": 936, "delta.new_output_token_id": 937, "param.packed_dim": 938, "_map_nam": 939, "request.observe_finished_request": 940, "llm_flex": 941, "subparsers.": 942, "vllm.v1.attention.backends.flex_attention.flex": 943, "config.classifier_pooling.upp": 944, "n_blocks_seqlen": 945, "inspect.parameter.keyword": 946, "quant_hidden_st": 947, "waiting_seq": 948, "speculation_config.speculative_token_tre": 949, "torch.n": 950, "tp2": 951, "mllamaselfattentiondecoderlay": 952, "routingmethodtyp": 953, "selected_backend": 954, "reinterpret_cast": 955, "q_req": 956, "nvml_nvlink_cap_sli_bridg": 957, "fakenixlwrapper.": 958, "device.gpu.": 959, "generate_propos": 960, "value_list.append": 961, "sre_constants.assert_not": 962, "reuse_buffers.append": 963, "__main__.c_nvml": 964, "multimodalkwargsitem.from": 965, "trade-off": 966, "wrapper.data": 967, "modelperm-": 968, "preclud": 969, "tool_content_start": 970, "asm": 971, "parsed_cont": 972, "nvmldevicegetmemorybuswidth": 973, "boundary_left": 974, "_assert_mm_data_input": 975, "nvml_fi_dev_nvlink_crc_flit_error_count_l2": 976, "ncols-1": 977, "self._decode_wrappers_cudagraph": 978, "parse.parse_arg": 979, "ount": 980, "_dual_chunk_flash_attn_decod": 981, "matryoshka_fi": 982, "trl.grpoconfig.us": 983, "w13": 984, "mamba-on": 985, "mmarg": 986, "gradio-hash": 987, "modules.json": 988, ".awq": 989, "generic-enough": 990, "locally-cach": 991, "mistral_common.except": 992, "larger_s": 993, "self.c_layernorm": 994, "lib.cudasetdevic": 995, "aiter.flash": 996, "self.model_runner.list_lora": 997, "v1worker": 998, "eg.": 999, "mocksslcontext": 1000, "proport": 1001, "output.jsonl": 1002, "self.kv_cache_manag": 1003, "config.num_mel_bin": 1004, "weight.gath": 1005, "tensor.float": 1006, "dequantize_4bit": 1007, "triton_poi_fused__to_copy_add_addmm_cat_..": 1008, "nvmlerror": 1009, "scale_ref": 1010, "executor.layers.quantization.utils.gptq": 1011, "rpcprocessrequest": 1012, "self.waiting.remov": 1013, "__future__": 1014, "point.html": 1015, "no_data": 1016, "client.scal": 1017, "client_paramet": 1018, "_download_mistral_config_fil": 1019, "stride_b_dst": 1020, "samples.tolist": 1021, "tsunemoto": 1022, "customlogitprocsource.logitproc_source_class": 1023, "cache.split": 1024, "caches.clon": 1025, "config.gpu": 1026, "positions.to": 1027, "m-base": 1028, "get_hf_prompt_token": 1029, "wrapper.util": 1030, "self.video_needs_metadata": 1031, "self.l": 1032, "inlininginstructiontranslator.inline_cal": 1033, "request.add_generation_prompt": 1034, "metadata.logit": 1035, "sharegpt_20230401_clean_lang_split.json": 1036, "inputs_embeds.s": 1037, "pipe.send": 1038, "general.": 1039, "pool": 1040, "common.tokens.tokenizers.sentencepiec": 1041, "worker._expand_execute_model_request": 1042, "test_tool_choice_required.pi": 1043, "quantfp8": 1044, "nvml_gpm_metric_nvlink_l8_rx_per_sec": 1045, ".nsys-rep": 1046, ".uniform": 1047, "test_cannot_schedule_after_recv": 1048, "self._find_split_point": 1049, "vlmtesttyp": 1050, "_run_prefill_new_tokens_fa": 1051, "equal.": 1052, "latest_delta_len": 1053, "test_single_chat_session_audio_base64encod": 1054, "--preset": 1055, "param.load_merged_column_weight": 1056, "next_max_token": 1057, "loraconfig.": 1058, "decode_instances.get": 1059, "partial_prefill_metadata.can_schedul": 1060, "layer.w13_weight_g_idx.devic": 1061, "hash_dict": 1062, "self.metrics.time_in_queu": 1063, "-prefill_0-": 1064, "self.first_rank": 1065, "nvmlunitgetpsuinfo": 1066, "cpu_tensor.is_pin": 1067, "stream_respons": 1068, "multipliers.": 1069, "trigger_completion_at_end": 1070, "p_src.join": 1071, "new_bsz": 1072, "self.supported_backend": 1073, "ef_paged_attn": 1074, "image_batch": 1075, "multilora": 1076, "boy": 1077, "param.ds_dequant": 1078, "resized_img": 1079, "falconforcausallm": 1080, "tlp": 1081, "total_length": 1082, "usecas": 1083, "te.supports_expert_map": 1084, "args.pf": 1085, "server_with_chunked_process": 1086, "self.seq_": 1087, "mteb.encod": 1088, "arg3_1": 1089, "self.variance_size_overrid": 1090, "mutable.content_hash": 1091, "test_most_model_len": 1092, "self.info.get_video_max_slice_num": 1093, "self.config.slid": 1094, "dockerfile.": 1095, "actor.set": 1096, "client.abort_requests_async": 1097, "stack.ent": 1098, "dim_v": 1099, "torch.z": 1100, "attention.forward_decod": 1101, "self.max_num_encoder_input_token": 1102, "inp.clon": 1103, "0.7.0": 1104, "meta.kv": 1105, "empty_config_dict.pop": 1106, "patch_slice.shap": 1107, "torch.strid": 1108, "moe.n_redundant_expert": 1109, "self.model_config.get_diff_sampling_": 1110, "merge_attn_states_torch": 1111, "dtype.items": 1112, "regex_str": 1113, "piecewise_respons": 1114, "destroy_distributed_environ": 1115, "asyncio.get": 1116, "num_gen_seq": 1117, "back-compat": 1118, "self.getitem_us": 1119, "self.prepare_finalize_typ": 1120, "_lazyregisteredmodel": 1121, "outputs.start": 1122, "stacked_embed": 1123, "allocator.create_immutable_chain": 1124, "huggingfacermsnorm": 1125, "responsbil": 1126, "input_audio_featur": 1127, "nvml_fi_dev_nvlink_crc_data_error_count_l7": 1128, "no_chunked_prefil": 1129, "np.moveaxi": 1130, "prompttokenusageinfo": 1131, "block_hashes2": 1132, "module.__name__": 1133, "torch.distributed.is_gloo_avail": 1134, "layer.output1_scales_scalar": 1135, "-config.context_s": 1136, "index2nam": 1137, "vllm.v1.output": 1138, "test_cpu_offload.pi": 1139, "lmhead": 1140, "cls_name": 1141, "enc_test_rsrcs.attn": 1142, "param.data.shap": 1143, "vllm_model.encod": 1144, "type.s8": 1145, "enginemodeldata.engine_model.get": 1146, "side_effect": 1147, "v4": 1148, "vllm.model_executor.layers.fused_moe.prepare_fin": 1149, ".clip": 1150, "granitemoehybrid": 1151, "_sys_msg": 1152, "reasoning_parser.vocab.get": 1153, "window_index.append": 1154, "l167-l170": 1155, "ent_platform.is_rocm": 1156, "_empty_long_tensor": 1157, "_timm_module.": 1158, "a2_scal": 1159, "config.supports_expert_map": 1160, "gpu.punicawrappergpu": 1161, "algos.pi": 1162, "padded_num_scheduled_tokens_per_req": 1163, "good_grids.append": 1164, "w1_fp4.shape": 1165, "_merge_mm_kwarg": 1166, "self.runner.attn_backend.make_metadata": 1167, "use_prefill_decode_attn": 1168, "num_it": 1169, "self.buffer.get_dispatch_layout": 1170, "trt-llm": 1171, "self.num_token_pad": 1172, "describetarget": 1173, "mamba2_attn.pi": 1174, "contributor": 1175, "divis": 1176, "nvmlerror._valclassmapping.get": 1177, "sparseattnconfig": 1178, "stopchecker.check_stop_str": 1179, "glm4_moe_tool_parser.tool_call_start_token_id": 1180, "ctx.request.encod": 1181, "layernorm_mlp_beta": 1182, "maxmemclockmhz": 1183, "query_attention_output": 1184, "phi-4-mini": 1185, "corrected.type_a": 1186, "tokenizer.speci": 1187, "self.__class__.nam": 1188, "instancecount": 1189, "_build_hcxvision_hf_info": 1190, "decoder_qkv.q_seq_len": 1191, "context.get": 1192, "c_nvmlnvlinkpowerthres_t": 1193, "visit_importfrom": 1194, "--custom-skip-chat-templ": 1195, "glm4moe": 1196, "swapped_queu": 1197, "removed_blocks.append": 1198, "embedding_models.item": 1199, "self.tensors.item": 1200, "role_s": 1201, "torch.ops.vllm._fused_mul_mat_gguf": 1202, "model_cls.is_text_generation_model": 1203, "resulthandl": 1204, "cap_sys_admin": 1205, "physical_po": 1206, "max_byt": 1207, "frame.": 1208, "zamba2model": 1209, "karresidualrmsnorm": 1210, "trimmed_nam": 1211, "global_expert_load.shap": 1212, "self.static_fwd_ctx.item": 1213, "concat_pixel_values_imag": 1214, "scaling.md": 1215, "x_scl_sat": 1216, "w4g128": 1217, "torch_out.max": 1218, "pg.broadcast": 1219, "-2.0": 1220, "loc.cpu": 1221, "hash": 1222, "step3_text.pi": 1223, "c.weak": 1224, "cgsp": 1225, "compute.": 1226, "parent_map": 1227, "no_top_p": 1228, ".mrope": 1229, "expanded.scatt": 1230, "test_completion_stream": 1231, "self.block_table.add_row": 1232, "self.lay": 1233, "schedulerrunningoutputs.create_empti": 1234, "send_method": 1235, "investigate.": 1236, "info.pop": 1237, "use_xformers_op": 1238, "aq_out.shap": 1239, "t23x": 1240, "cls.iter_item_to_byt": 1241, "zipfile.zipfil": 1242, "ground": 1243, "f07788": 1244, "item.slot_map": 1245, "slot_mapping.view": 1246, "llama-1.1b-chat-v0.3-gptq": 1247, "-curr_sliding_window_block": 1248, "num_active_lora": 1249, "tool_call.id": 1250, "value.adapter_id": 1251, "silly_lib": 1252, "__call__.": 1253, "target_r": 1254, "image_projector.down_proj.": 1255, "top_p_cutoff": 1256, "test_request.prompt_len": 1257, "model_info": 1258, "output2_scale_scalar": 1259, "grid.": 1260, "-level_num_draft": 1261, "vllm_use_flashinfer_sampl": 1262, "self.num_reasoning_token": 1263, "item.recipi": 1264, "sent": 1265, "vllm_config.compilation_config.disabled_custom_op": 1266, "mamba2_metadata.batch_ptr.resize_": 1267, "load_verify_loc": 1268, "test_config.num_expert": 1269, "from_list": 1270, "torch.ops._c.get_flash_mla_metadata": 1271, "final_response.model_dump": 1272, "3.5": 1273, "key.mro": 1274, "self.lora_checkpoint": 1275, "contiguous_split_chunk": 1276, "2007.": 1277, "piecewise_llm.gener": 1278, "padded_added_vocab_end_index": 1279, "show_available_model": 1280, "benchmark_prefil": 1281, "hidden_state.permut": 1282, "num_recomputing_lay": 1283, "xgr.grammar.from_structural_tag": 1284, "provided.": 1285, "self._all_token_ids.extend": 1286, ".bia": 1287, "self.get_max_audio_tokens_per_chunk": 1288, "config.cmak": 1289, "get_token_count": 1290, "gemma-3n-e2b-it": 1291, "tensor_tmp": 1292, "1-m": 1293, "envs.vllm_use_ray_compiled_dag_overlap_comm": 1294, "lq": 1295, "bitblas.quantization.util": 1296, "_sequenc": 1297, "_pixel_values_imag": 1298, "--override-pooler-config": 1299, "last_token_offset": 1300, "model.model.layers.11.q": 1301, "output_start_idx": 1302, "manager.block_pool.null_block": 1303, "audio_length": 1304, "create_dummy_sequ": 1305, "nisa.dma": 1306, "detail": 1307, "s8": 1308, "scale_hidden_s": 1309, "create_attention_inst": 1310, "vllm.multimodal.parse.multi": 1311, ".cxb": 1312, "nvml_fi_dev_ecc_pend": 1313, "instance_lay": 1314, "inter-token": 1315, "output_shap": 1316, "group.descript": 1317, "config.weight_bit": 1318, "envinfo": 1319, "valid_token": 1320, "scheduler._add_seq_group_to_run": 1321, "o_block_ptr.dtype.element_ti": 1322, "sampler_output2": 1323, "metadata.add": 1324, "batchedoaitritonexpert": 1325, "final_msg.cont": 1326, "normal_dist": 1327, "video_grid_thw_on_devic": 1328, "self.device_communicator.all_gath": 1329, "request.use_structured_output": 1330, "rpcabortrequest": 1331, "computedblockstrack": 1332, "build_video_inputs_from_test_info": 1333, "return_as_token_id": 1334, "llamamodel.load": 1335, "test_detokenize_fals": 1336, "dstackai": 1337, "vllm_model.llm": 1338, "-self.max": 1339, "torch.sdpa": 1340, "nvidia-smi": 1341, "semanticsegmentationtask": 1342, ".node_ip": 1343, "c2x.cu...": 1344, "mi300a": 1345, "apionlyservermanag": 1346, "dots.llm1.inst": 1347, "retry_delay": 1348, "multi-node.": 1349, "--data-parallel-start-rank": 1350, "other.torch_peak": 1351, "dynamic.pi": 1352, "amdsmi.amdsmi_shut_down": 1353, "__mod__": 1354, "lora_list": 1355, "tool_delta": 1356, "v1poolingmetadata": 1357, "ids.cpu": 1358, "max_context_length": 1359, "common_prompt": 1360, "_usage_stats_en": 1361, "._cached_apply_hf_processor": 1362, "self.ctx.init_processor": 1363, "args.warmup_percentages.split": 1364, "schedulerconfig.max_num_seq": 1365, "tensor.flatten": 1366, "_initialize_loader_st": 1367, "torch.ops._rocm_c.paged_attent": 1368, "send.append": 1369, "num_query_heads_per_kv_head": 1370, "zmq.xsub": 1371, "flash2": 1372, "from_2_way_softmax": 1373, "self.output_lay": 1374, "vllm.v1.core.kv_cache_coordin": 1375, "config_for_seri": 1376, "logits_sort": 1377, "certchain": 1378, "--time-gener": 1379, "recoverable.": 1380, "self._functional_fused_add_rmsnorm_then_qu": 1381, "currentclockspe": 1382, "n_ctx": 1383, "mqenginedeaderror": 1384, "speculative_config.draft_model_config.hf_config": 1385, "raw_request.head": 1386, "jamba_tokenizer.encod": 1387, "80.00": 1388, "singleton": 1389, "width_idx": 1390, "compilationconfig.": 1391, "envs.vllm_all2all_backend": 1392, "self._socket_setup": 1393, "layernorm2d": 1394, "cpu_model_runner.pi": 1395, "batch.ev": 1396, "use_scalar_scale_a": 1397, "config.audio_processor.get": 1398, "local_kv_head": 1399, "input_batch_s": 1400, "req_blocks.extend": 1401, "max_partit": 1402, "serving_json": 1403, "messagequeue.create_from_handl": 1404, "nixlwrapp": 1405, "queue.extendleft": 1406, "v0.7.0": 1407, "self.num_free_slot": 1408, "librosa.get_dur": 1409, "self.init_lora": 1410, "platform.empti": 1411, "up.clamp": 1412, "engine_nam": 1413, "beam_search.pi": 1414, "_multimodal_example_models.item": 1415, "get_chat_request_rol": 1416, "vllm.model_executor.layers.mamba.mamba_mix": 1417, "embeds.md": 1418, "config.convert_typ": 1419, "self._pad_to_shap": 1420, "bench.": 1421, "make_worker_process": 1422, "prefill_query_start_loc": 1423, "s.token": 1424, "enabl": 1425, "18640.": 1426, "k_r_i": 1427, "f4a06998b75ed78bbf5aaf569590b772ea26c9f6": 1428, "scheduler_config.preemption_mod": 1429, "getter": 1430, "publisher_config.replay_endpoint": 1431, "granite-20b-functioncalling-fp8-kv": 1432, "batchlogprobscomposition.sample_prompt": 1433, "null": 1434, "future.get_loop": 1435, "p.data.dtyp": 1436, "llavanextvideodummyinputsbuild": 1437, "self._print_lin": 1438, "raw_data_cols.append": 1439, "op.i": 1440, "cpu_typ": 1441, "os.path.realpath": 1442, "metrics.buckets.item": 1443, "expected_logcnt": 1444, "multiplier_top2": 1445, "stream.finish": 1446, "decilmattent": 1447, "num_nod": 1448, "language_model": 1449, "nvmlbridgechiphierarchi": 1450, "resume_download": 1451, "param.uniform_": 1452, "self.squar": 1453, "seqb.i": 1454, "kv_cache_old": 1455, ".lora": 1456, "gather_mm_placehold": 1457, "grouped.view": 1458, "model.layers.0.down": 1459, "experimental_config": 1460, "_allow_async_output_proc": 1461, "ref_prmpt_tok_lp_rank": 1462, "w2_input_global_scal": 1463, "tensorparallel": 1464, "step_pool": 1465, "blocking.": 1466, "standard_quant_typ": 1467, "make_n_rand_sparse_tensor": 1468, "output.result.result": 1469, "_instanc": 1470, "huggingface_hub.constants.hf_hub_enable_hf_transf": 1471, "patch_grid_length": 1472, "optimis": 1473, "test_request_logger_log_outputs_streaming_delta": 1474, "adapter_config.upd": 1475, "bucket_coords_w": 1476, "modelexport": 1477, "make_meta": 1478, "mock_abspath.return_valu": 1479, "mq_broadcast": 1480, "importlib.reload": 1481, "rope_emb": 1482, "1z9tvqzzbpnh5whcrwjvk2ueefeq5zmzb5mfe8jr0hc": 1483, "vision_encod": 1484, "promethus.": 1485, "self.supports_mm": 1486, "non-determin": 1487, "processor.frame_r": 1488, "scalar_types.int8": 1489, "vllm_use_flashinfer_moe_mxfp4_mxfp8": 1490, "profiling.": 1491, "filepath.open": 1492, "self.prefill_seq_len": 1493, "consum": 1494, "api_keyword_arg": 1495, "_ggml_mul_mat_a8_fak": 1496, "runti": 1497, "fc.": 1498, "to_devic": 1499, "max_blocks_per_seq": 1500, "features.s": 1501, "n_act": 1502, "test_mteb_scor": 1503, "mean_sk": 1504, "adjust_request": 1505, "item.index": 1506, "_verify_prefix_cach": 1507, "fail": 1508, "decoder-only.": 1509, "cohere2": 1510, "auto_round": 1511, ".minicpm": 1512, "incorrectly.": 1513, "end_loc": 1514, "4-5x": 1515, "self.page_s": 1516, "likaixin": 1517, "self.metrics.first_scheduled_tim": 1518, "skywork": 1519, "self.metrics.histogram_num_generation_tokens_request": 1520, "cls.from_dict": 1521, "v.repeat": 1522, "_init_data_parallel": 1523, "core.scheduler.wait": 1524, "lobe-chat": 1525, "container_id": 1526, "engines...": 1527, "temp.vers": 1528, "tensor.tensor_typ": 1529, "self.data_parallel_rank": 1530, "case.operation.path": 1531, "test_lora_weights_map": 1532, "state.valu": 1533, "mock_request.continue_final_messag": 1534, "self.mup_scale_factor": 1535, "dpcoordinatorproc": 1536, "visual_token": 1537, "args.format": 1538, "depths_row": 1539, ".norm.": 1540, "segm_output_ptr": 1541, "self.orig_seq_len": 1542, "engine.start": 1543, "nvmlvgpucap": 1544, "autoencod": 1545, "vertex": 1546, "modelinputforgpubuild": 1547, "tool.function.argu": 1548, "eventset": 1549, "page-s": 1550, "layer.w2_qweight.shap": 1551, "departure_": 1552, "fix.": 1553, "t2.data_ptr": 1554, "cohere_rerank_client.pi": 1555, "_state.init": 1556, "test_merge_async_iter": 1557, "r_outputs.num_prefill_group": 1558, "cudaipcmemhandl": 1559, "param_": 1560, "self.cudagraph_capture_s": 1561, "16khz": 1562, "completion.id": 1563, "original_param": 1564, "tensor.sum": 1565, "disable_cascade_attn": 1566, "neuron_framework": 1567, "odels_config_map.get": 1568, "all_to_al": 1569, "model_cli": 1570, "prefill_meta.seq_start_loc": 1571, "cumulative_index": 1572, "vllm-1": 1573, "fake_problematic_input": 1574, ".t": 1575, "ssl.pi": 1576, "self.sub.setsockopt": 1577, "self._log_counter_label": 1578, "01c7f73d771dfac7d292323805ebc428287df4f9": 1579, "is_not_transpos": 1580, "embedding.view": 1581, "get_python_execut": 1582, "plan.": 1583, "enable.": 1584, "test_completion.pi": 1585, "finishedrequeststat": 1586, "impl_config.types.accumul": 1587, "rbranch": 1588, "encoder.": 1589, "data.req": 1590, "input.lora": 1591, "get_continuous_batch": 1592, "dramencryptionmode.encryptionst": 1593, "decode_meta.block_tables_succ": 1594, "device_prop": 1595, "torch_module_nam": 1596, "self.presence_penalties_req": 1597, "_check_vllm_model_forward": 1598, "summary.md": 1599, "xla_output.cpu": 1600, "readinessprob": 1601, "self._get_weights_iter": 1602, "wheel.filelist": 1603, "--tensor-parallel-s": 1604, "eck": 1605, "data.ref_out_tensor": 1606, "get_open_zmq_inproc_path": 1607, "simulator._routing_strategi": 1608, "post_attention_layernorm": 1609, "o_i": 1610, "tensors.a.shap": 1611, "importlib.metadata.metadata": 1612, "get_image_featur": 1613, "torch.randint": 1614, "config.max_seq_len_to_captur": 1615, "config.encrypt": 1616, "rc": 1617, "new_answ": 1618, "link.sub": 1619, "multi-devic": 1620, "pan": 1621, "dw": 1622, "hf_processor._get_image_repl_featur": 1623, "image_newline_emb.expand": 1624, "a_cs_ptr": 1625, "neox.pi": 1626, "base64_tensor_embed": 1627, "_boundpromptsequence.from_seq": 1628, "fp4.dtype": 1629, "self.load_byt": 1630, "vllm-spyre": 1631, "tc.function": 1632, "hot-swap": 1633, "config.drop": 1634, "transformers.models.auto.token": 1635, "_key": 1636, "self.inter_data_list.append": 1637, "lora_a_weight.s": 1638, "28ficedula_superciliari": 1639, "re.compil": 1640, "hf_model.save_pretrain": 1641, "rollback": 1642, "nvml_fi_dev_nvlink_speed_mbps_l11": 1643, "mantisforconditionalgener": 1644, "short_seqs.append": 1645, "real_range.length": 1646, "common.pi": 1647, "_process_model_output": 1648, "num_patches_video": 1649, "user-assign": 1650, "seq_gr": 1651, "torch.clamp": 1652, "ngram_propos": 1653, "baz": 1654, "4h.": 1655, "bar1fre": 1656, "self.mid.attn_1": 1657, "tensor_constructors_to_patch": 1658, "output_conv": 1659, "metric.valu": 1660, "block3.block_id": 1661, "torch.ops.xla.bgmv": 1662, "num_job": 1663, "seq_len_2": 1664, "presence_penalties_t": 1665, "seq_id_offset": 1666, "raise_except": 1667, "test_two_responses_with_same_prev_id": 1668, "b_p": 1669, "request.i": 1670, "preemption_metr": 1671, "stateless_destroy_torch_distributed_process_group": 1672, "nn.init.trunc_normal_": 1673, "self.v": 1674, "self.scheduler.make_stat": 1675, "framebuff": 1676, "1.self_attn.": 1677, "deepgemm_block_shap": 1678, "idx.reshap": 1679, "nvmlvgputypegetcap": 1680, "self.v_head": 1681, "total_num_hidden_lay": 1682, "openai.async": 1683, "jais-13b-chat": 1684, "disabled_llm.llm_engine.model_config": 1685, "new_embeddings_bin_file_path": 1686, "guided_decoding_param": 1687, "self.tool_name_reg.search": 1688, "torch.distributed.group.world": 1689, "arch.startswith": 1690, "allow_sampl": 1691, "_selective_scan_update_kernel": 1692, "__setattr__": 1693, "fbc": 1694, "lp.decoded_token": 1695, "self.positional_embedding_vlm": 1696, "format.json": 1697, "model.layers.0.qkv_proj": 1698, "e_queue_request": 1699, "docs.nvidia.com": 1700, "mptmodel": 1701, "node_s": 1702, "preprocess": 1703, "key_cache_compact": 1704, "self.target_modules.append": 1705, "final_chunk": 1706, "builtins.enumer": 1707, "_nvmladaptiveclockinfostatus_t": 1708, "self._recv_impl": 1709, "check_moe_marlin_supports_lay": 1710, "self.pipeline_parallel_rank": 1711, "star": 1712, "stat_nam": 1713, ".prompt_len": 1714, "parsers.key": 1715, "test_flash_attn": 1716, "self.info.ctx.model_config.mm_processor_kwarg": 1717, "recv_x_scale.strid": 1718, "_supports_pp_attribut": 1719, "self.dec": 1720, "image_asset": 1721, "is_generative_model": 1722, "encoder_prompt_str": 1723, "multi-step.": 1724, "attn_backend.get_metadata_cl": 1725, "config.supports_apply_weight_on_input": 1726, "pm.fwd": 1727, "is_quantized_kv_cach": 1728, "c.dir": 1729, "layer.qzero": 1730, "trip.start": 1731, "pe_weight": 1732, "vertical_topk_buff": 1733, "tpus": 1734, "self.data.get_num_computed_token": 1735, "atk": 1736, "speculative_draft_tensor_parallel_size.": 1737, "ignore_mm_key": 1738, "main_mp": 1739, "self.tool_block_start": 1740, "np.int64": 1741, "gemm1_clamp_limit": 1742, "modelcloud": 1743, "self.buffer_ptr": 1744, "score_utils.pi": 1745, "alibi_bias.view": 1746, "self.nccl.unique_id_from_byt": 1747, ".lock": 1748, "inference_kwarg": 1749, "scale.devic": 1750, "cpu_fused_moe.sgl": 1751, "cutlassexpertsfp4": 1752, "self._find_array": 1753, "cache.reshap": 1754, "dev_msg_cont": 1755, "_flash_attn_varlen_diff_headdims_rocm": 1756, "kv_connector.bind_connector_metadata": 1757, "llm-compressor": 1758, "cumsum.cuda": 1759, "self._construct_input_messages_with_harmoni": 1760, "self._removed.pop": 1761, "stablelmconfig": 1762, "seq_with_no_audio_tok": 1763, "token_ids_single_batch": 1764, "local_s": 1765, "self.config.norm_topk_prob": 1766, "granite_reasoning_parser.pi": 1767, "self.eplb_step": 1768, "self.input_qu": 1769, "test_llama_lora_tp4": 1770, "du5k": 1771, "call.is_valid_id": 1772, "model_runner_output.logprob": 1773, "triangular": 1774, "ids.appendleft": 1775, "neuronx.valu": 1776, "_should_buffer_cont": 1777, "self.lora_alpha": 1778, "executor.layers.layernorm": 1779, "non_zero_elements_list": 1780, "dynamic_preprocess_h2ovl": 1781, "tokenizer.get_vocab": 1782, ".output_queri": 1783, "layer.w2_input_scale_qu": 1784, "_prepare_decoder_input_ids_for_gener": 1785, "reset": 1786, "v_indic": 1787, "decoder_dummy_data.": 1788, "test_fp8.pi": 1789, "worker.execute_model": 1790, "deepep_ht_arg": 1791, "self.calcul": 1792, "samplingmetadata.prepar": 1793, "torch.ops.xla.dynamo_set_buffer_donor_": 1794, "sampled_vid": 1795, "self.data_ipc_path": 1796, "glm4for": 1797, "gelu": 1798, "tinyllama-24-gptq-8bit-channelwis": 1799, "sbmax6649": 1800, "nvmldevicegetsupportedclocksthrottlereason": 1801, "alphabet": 1802, "pl": 1803, "--kv-events-config": 1804, "supported_mm_limit": 1805, "c_coolerinfo": 1806, "prepack_dispatch_templ": 1807, "generator.get": 1808, "logits_old": 1809, "top-rank": 1810, "self.tool_call_parameter_regex.findal": 1811, "tool_call_info.tools_cal": 1812, "_should_use_marlin": 1813, "new_weights.item": 1814, ".get_num_tot": 1815, "nvmlclockseventreasonswpowercap": 1816, "requires_fil": 1817, "w2.weight": 1818, "tracing_en": 1819, "windowqform": 1820, "self._compute_cascade_attn_prefix_len": 1821, "unpacked.to": 1822, "k.max": 1823, "nvmlsystemgetconfcomputeset": 1824, "regime.__members__": 1825, "b.default": 1826, "self.metric.set": 1827, "self.attention.forward": 1828, "unzip": 1829, "custom_logitsproc": 1830, "video_output": 1831, "values.mask": 1832, "self.max_cudagraph_mod": 1833, "self.frontend": 1834, "dbrxrouter": 1835, "c_nvmlvgpuplacementid_v1_t": 1836, "begin_of_text": 1837, "vllm.entrypoints.harmony_util": 1838, "is_standard_fused_expert": 1839, "ext_v1": 1840, "stride_k_cache_b": 1841, "revert": 1842, "pretty_str": 1843, "idefics2config": 1844, "engine_counts.valu": 1845, "submit": 1846, "module.quant_method.block_qu": 1847, "eva2clipmlp": 1848, "vllm.platforms.neuron.neuronplatform": 1849, "second_chain_block.content_hash": 1850, "marlin_24_model.generate_greedy_logprob": 1851, "c_memory.vers": 1852, "--accelerator-typ": 1853, "implemented.": 1854, "ff_proj": 1855, "self.temperature_cpu_tensor.numpi": 1856, "inf.": 1857, "current_width": 1858, "high-logit": 1859, "args.prefix": 1860, "self.batch_update_builder.peek_remov": 1861, "locationtyp": 1862, "tina": 1863, "tp-shard": 1864, "s.rsplit": 1865, "config.layer_norm_ep": 1866, "number.": 1867, "self.max_chunk": 1868, "had": 1869, "self._reqs_to_send": 1870, "session_array": 1871, "torch.mask": 1872, "audio_base64": 1873, "valueerror.": 1874, "self.max_tokens_param": 1875, "sched_out": 1876, "length.siz": 1877, "args.endpoint_typ": 1878, "seq.seq": 1879, "gptneoxlay": 1880, "get_max_output_token": 1881, "kv_indices.extend": 1882, "torch.argmin": 1883, "default_pooling_param": 1884, "opentelemetry-semantic-conventions-ai": 1885, "engine.engine_cor": 1886, "self._update_num_xla_graph": 1887, "limit_cpu_concurr": 1888, "extracted_tool_calls.tools_cal": 1889, "self._init_possible_resolut": 1890, "llavaonevisionconfig": 1891, "free_gpu_blocks.pop": 1892, "t-300m-448px": 1893, "vllm_config.parallel_config.disable_custom_all_reduc": 1894, "float8_e8m0_max_exp": 1895, "current_tool_call_match": 1896, "employ": 1897, "modelconfig.logits_processor": 1898, "lut.": 1899, "num_children": 1900, "get_kv_transfer_group": 1901, "llama": 1902, "pre": 1903, "num_total_cpu": 1904, "concurrent.futures.executor": 1905, "ctx.request_id": 1906, "modelinputforgpuwithsamplingmetadata.from": 1907, "internally.": 1908, "everybodi": 1909, "view_as_4d": 1910, "ref_llm.chat": 1911, "gate.clamp": 1912, "torch._custom_op.impl.infer_schema": 1913, "els": 1914, "eval": 1915, "deriv": 1916, "._apply_token_match": 1917, "-127": 1918, "config.vision_config.hidden_s": 1919, "v0.pi": 1920, "scale_half.to": 1921, "5555a": 1922, ".quant": 1923, "self.engine_manag": 1924, "make_moe_tensor": 1925, "no.": 1926, "seq_group_metadata.is_prompt": 1927, "make_ndarray_with_pad": 1928, "embeds.new": 1929, "1rg": 1930, "status.bad_request": 1931, "test_scheduler_encoder_decoder.pi": 1932, "mock_model_config": 1933, "wte.new": 1934, "self.image_attention_mask": 1935, "request.return_token_str": 1936, "json.decoder.jsondecodeerror": 1937, "long_text_2500_word": 1938, "tmacoop_": 1939, "ap_pair": 1940, "self.input_batch.in_progress_prompt_logprobs_cpu": 1941, "final_featur": 1942, "cpu_block_alloc": 1943, "lf.slot": 1944, "weights.valu": 1945, "self._proxy.block_id": 1946, "local_path.sett": 1947, "censor": 1948, "vllm-compat": 1949, "--8": 1950, "df.iloc": 1951, 