{"vllm": 0, "code": 1, "conduct": 2, "our": 3, "pledge": 4, "we": 5, "members": 6, "contributors": 7, "leaders": 8, "make": 9, "participation": 10, "community": 11, "harassment": 12, "free": 13, "experience": 14, "everyone": 15, "regardless": 16, "age": 17, "body": 18, "size": 19, "visible": 20, "invisible": 21, "disability": 22, "ethnicity": 23, "sex": 24, "characteristics": 25, "gender": 26, "identity": 27, "expression": 28, "level": 29, "education": 30, "socioeconomic": 31, "status": 32, "nationality": 33, "personal": 34, "appearance": 35, "race": 36, "caste": 37, "color": 38, "religion": 39, "sexual": 40, "orientation": 41, "act": 42, "interact": 43, "ways": 44, "contribute": 45, "open": 46, "welcoming": 47, "diverse": 48, "inclusive": 49, "healthy": 50, "standards": 51, "examples": 52, "behavior": 53, "contributes": 54, "positive": 55, "environment": 56, "include": 57, "demonstrating": 58, "empathy": 59, "kindness": 60, "toward": 61, "other": 62, "people": 63, "being": 64, "respectful": 65, "differing": 66, "opinions": 67, "viewpoints": 68, "experiences": 69, "giving": 70, "gracefully": 71, "accepting": 72, "constructive": 73, "feedback": 74, "responsibility": 75, "apologizing": 76, "those": 77, "affected": 78, "mistakes": 79, "learning": 80, "from": 81, "focusing": 82, "what": 83, "best": 84, "just": 85, "us": 86, "individuals": 87, "overall": 88, "unacceptable": 89, "use": 90, "sexualized": 91, "language": 92, "imagery": 93, "attention": 94, "advances": 95, "any": 96, "kind": 97, "trolling": 98, "insulting": 99, "derogatory": 100, "comments": 101, "political": 102, "attacks": 103, "public": 104, "private": 105, "publishing": 106, "others": 107, "information": 108, "physical": 109, "email": 110, "address": 111, "without": 112, "explicit": 113, "permission": 114, "which": 115, "could": 116, "reasonably": 117, "considered": 118, "inappropriate": 119, "professional": 120, "setting": 121, "enforcement": 122, "responsibilities": 123, "responsible": 124, "clarifying": 125, "enforcing": 126, "acceptable": 127, "take": 128, "appropriate": 129, "fair": 130, "corrective": 131, "action": 132, "response": 133, "deem": 134, "threatening": 135, "offensive": 136, "harmful": 137, "have": 138, "right": 139, "remove": 140, "edit": 141, "reject": 142, "commits": 143, "wiki": 144, "edits": 145, "issues": 146, "contributions": 147, "aligned": 148, "communicate": 149, "reasons": 150, "moderation": 151, "decisions": 152, "when": 153, "scope": 154, "applies": 155, "within": 156, "all": 157, "spaces": 158, "also": 159, "individual": 160, "officially": 161, "representing": 162, "using": 163, "official": 164, "posting": 165, "via": 166, "social": 167, "media": 168, "account": 169, "acting": 170, "appointed": 171, "representative": 172, "online": 173, "offline": 174, "irl": 175, "event": 176, "instances": 177, "abusive": 178, "harassing": 179, "otherwise": 180, "may": 181, "reported": 182, "channel": 183, "slack": 184, "https": 185, "ai": 186, "complaints": 187, "reviewed": 188, "investigated": 189, "promptly": 190, "fairly": 191, "obligated": 192, "respect": 193, "privacy": 194, "security": 195, "reporter": 196, "incident": 197, "guidelines": 198, "follow": 199, "impact": 200, "determining": 201, "consequences": 202, "violation": 203, "correction": 204, "deemed": 205, "unprofessional": 206, "unwelcome": 207, "consequence": 208, "written": 209, "warning": 210, "providing": 211, "clarity": 212, "around": 213, "nature": 214, "explanation": 215, "why": 216, "apology": 217, "requested": 218, "through": 219, "single": 220, "series": 221, "actions": 222, "continued": 223, "interaction": 224, "involved": 225, "including": 226, "unsolicited": 227, "specified": 228, "period": 229, "time": 230, "includes": 231, "avoiding": 232, "interactions": 233, "well": 234, "external": 235, "channels": 236, "like": 237, "violating": 238, "terms": 239, "lead": 240, "temporary": 241, "permanent": 242, "ban": 243, "serious": 244, "sustained": 245, "sort": 246, "communication": 247, "allowed": 248, "during": 249, "pattern": 250, "aggression": 251, "disparagement": 252, "classes": 253, "attribution": 254, "adapted": 255, "contributor": 256, "covenant": 257, "www": 258, "org": 259, "version": 260, "available": 261, "v2": 262, "code_of_conduct": 263, "html": 264, "were": 265, "inspired": 266, "mozilla": 267, "ladder": 268, "github": 269, "com": 270, "inclusion": 271, "answers": 272, "common": 273, "questions": 274, "about": 275, "see": 276, "faq": 277, "translations": 278, "import": 279, "glob": 280, "requires_files": 281, "requirements": 282, "txt": 283, "pyproject": 284, "toml": 285, "file": 286, "print": 287, "cleaning": 288, "lines": 289, "readlines": 290, "torch": 291, "join": 292, "lower": 293, "removed": 294, "line": 295, "write": 296, "else": 297, "strip": 298, "done": 299, "markdownlint": 300, "disable": 301, "md001": 302, "md041": 303, "align": 304, "center": 305, "picture": 306, "source": 307, "prefers": 308, "scheme": 309, "dark": 310, "srcset": 311, "raw": 312, "githubusercontent": 313, "project": 314, "main": 315, "docs": 316, "assets": 317, "logos": 318, "logo": 319, "text": 320, "png": 321, "img": 322, "alt": 323, "src": 324, "light": 325, "width": 326, "55": 327, "h3": 328, "easy": 329, "fast": 330, "cheap": 331, "llm": 332, "serving": 333, "href": 334, "documentation": 335, "blog": 336, "arxiv": 337, "abs": 338, "2309": 339, "06180": 340, "paper": 341, "vllm_project": 342, "twitter": 343, "discuss": 344, "user": 345, "forum": 346, "developer": 347, "latest": 348, "news": 349, "2025": 350, "08": 351, "hosted": 352, "beijing": 353, "meetup": 354, "mp": 355, "weixin": 356, "qq": 357, "dgkwg1wfpwgo2jcdtqqhxa": 358, "large": 359, "scale": 360, "deployment": 361, "please": 362, "find": 363, "slides": 364, "here": 365, "drive": 366, "google": 367, "folders": 368, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 369, "recording": 370, "chaspark": 371, "live": 372, "1166916873711665152": 373, "05": 374, "nyc": 375, "lu": 376, "ma": 377, "c1rqyf1f": 378, "presentation": 379, "1_q_aw_iomjwuimf1s1ym": 380, "zhjxz8cuel0ijvaquoybea": 381, "usp": 382, "sharing": 383, "now": 384, "under": 385, "pytorch": 386, "foundation": 387, "announcement": 388, "welcomes": 389, "01": 390, "excited": 391, "announce": 392, "alpha": 393, "release": 394, "v1": 395, "major": 396, "architectural": 397, "upgrade": 398, "7x": 399, "speedup": 400, "clean": 401, "optimized": 402, "execution": 403, "loop": 404, "zero": 405, "overhead": 406, "prefix": 407, "caching": 408, "enhanced": 409, "multimodal": 410, "support": 411, "more": 412, "check": 413, "out": 414, "post": 415, "27": 416, "details": 417, "summary": 418, "previous": 419, "04": 420, "asia": 421, "day": 422, "sginnovate": 423, "limited": 424, "availability": 425, "morning": 426, "evening": 427, "slots": 428, "remaining": 429, "inaugural": 430, "team": 431, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 432, "03": 433, "ollama": 434, "inference": 435, "night": 436, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 437, "first": 438, "china": 439, "n77gibl2coratqhtveazfg": 440, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 441, "east": 442, "coast": 443, "7mu4k4xx": 444, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 445, "slide": 446, "id": 447, "g31441846c39_0_0": 448, "02": 449, "ninth": 450, "h7g3kuj9": 451, "meta": 452, "1jzc_pzvxrvnsfvcw": 453, "v4cfxb6pn7zz2cyp_flwo05aqg": 454, "amd": 455, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 456, "view": 457, "posted": 458, "eighth": 459, "zep56hui": 460, "cloud": 461, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 462, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 463, "2024": 464, "12": 465, "joins": 466, "ecosystem": 467, "11": 468, "seventh": 469, "h0qvrajz": 470, "wi": 471, "th": 472, "snowflake": 473, "1e3cxqbv3jsfgp30swyvs3em_tw": 474, "ghohj9pajgk6kr54": 475, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 476, "10": 477, "created": 478, "coordinating": 479, "discussing": 480, "features": 481, "feel": 482, "ray": 483, "summit": 484, "held": 485, "special": 486, "track": 487, "opening": 488, "talk": 489, "1b_kqxphbtra_mdf": 490, "tr6i8rwdou5qotznceg2mkzxehm": 491, "learn": 492, "talks": 493, "youtube": 494, "playlist": 495, "list": 496, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 497, "users": 498, "09": 499, "sixth": 500, "87q3nvnh": 501, "nvidia": 502, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 503, "9wqyp7ny93xrs": 504, "07": 505, "fifth": 506, "lp0gyjqr": 507, "aws": 508, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 509, "partnership": 510, "supports": 511, "llama": 512, "fp8": 513, "quantization": 514, "pipeline": 515, "parallelism": 516, "23": 517, "llama31": 518, "06": 519, "fourth": 520, "agivllm": 521, "cloudflare": 522, "bentoml": 523, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 524, "third": 525, "robloxandvllmmeetup2024": 526, "splashthat": 527, "roblox": 528, "1a": 529, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 530, "second": 531, "ygxbpzhl": 532, "ibm": 533, "12mi2skabnuw5rbwxdyy": 534, "hthth4imsnceoq10jdqbxga": 535, "2023": 536, "a16z": 537, "1ql": 538, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 539, "would": 540, "express": 541, "sincere": 542, "gratitude": 543, "andreessen": 544, "horowitz": 545, "30": 546, "supporting": 547, "generous": 548, "grant": 549, "development": 550, "research": 551, "released": 552, "fastchat": 553, "integration": 554, "has": 555, "powered": 556, "lmsys": 557, "vicuna": 558, "chatbot": 559, "arena": 560, "chat": 561, "since": 562, "mid": 563, "april": 564, "library": 565, "originally": 566, "developed": 567, "sky": 568, "computing": 569, "lab": 570, "cs": 571, "berkeley": 572, "edu": 573, "uc": 574, "evolved": 575, "driven": 576, "both": 577, "academia": 578, "industry": 579, "state": 580, "art": 581, "throughput": 582, "efficient": 583, "management": 584, "key": 585, "value": 586, "memory": 587, "pagedattention": 588, "20": 589, "continuous": 590, "batching": 591, "incoming": 592, "requests": 593, "model": 594, "cuda": 595, "hip": 596, "graph": 597, "quantizations": 598, "gptq": 599, "2210": 600, "17323": 601, "awq": 602, "2306": 603, "00978": 604, "autoround": 605, "05516": 606, "int4": 607, "int8": 608, "kernels": 609, "flashattention": 610, "flashinfer": 611, "speculative": 612, "decoding": 613, "chunked": 614, "prefill": 615, "flexible": 616, "seamless": 617, "popular": 618, "hugging": 619, "face": 620, "models": 621, "high": 622, "various": 623, "algorithms": 624, "parallel": 625, "sampling": 626, "beam": 627, "search": 628, "tensor": 629, "data": 630, "expert": 631, "distributed": 632, "streaming": 633, "outputs": 634, "openai": 635, "compatible": 636, "api": 637, "server": 638, "gpus": 639, "cpus": 640, "intel": 641, "powerpc": 642, "tpu": 643, "neuron": 644, "multi": 645, "lora": 646, "seamlessly": 647, "most": 648, "huggingface": 649, "transformer": 650, "llms": 651, "mixture": 652, "mixtral": 653, "deepseek": 654, "v3": 655, "embedding": 656, "e5": 657, "mistral": 658, "modal": 659, "llava": 660, "full": 661, "supported": 662, "en": 663, "supported_models": 664, "getting": 665, "started": 666, "install": 667, "pip": 668, "getting_started": 669, "installation": 670, "gpu": 671, "index": 672, "build": 673, "wheel": 674, "bash": 675, "visit": 676, "quickstart": 677, "contributing": 678, "welcome": 679, "collaborations": 680, "how": 681, "get": 682, "sponsors": 683, "compute": 684, "resources": 685, "testing": 686, "following": 687, "organizations": 688, "thank": 689, "you": 690, "your": 691, "note": 692, "them": 693, "alphabetical": 694, "order": 695, "keep": 696, "consistent": 697, "md": 698, "cash": 699, "donations": 700, "dropbox": 701, "sequoia": 702, "capital": 703, "skywork": 704, "zhenfund": 705, "alibaba": 706, "anyscale": 707, "crusoe": 708, "databricks": 709, "deepinfra": 710, "lambda": 711, "nebius": 712, "novita": 713, "replicate": 714, "runpod": 715, "trainy": 716, "san": 717, "diego": 718, "sponsor": 719, "fundraising": 720, "venue": 721, "opencollective": 722, "plan": 723, "fund": 724, "maintenance": 725, "adoption": 726, "citation": 727, "cite": 728, "bibtex": 729, "inproceedings": 730, "kwon2023efficient": 731, "title": 732, "author": 733, "woosuk": 734, "kwon": 735, "zhuohan": 736, "li": 737, "siyuan": 738, "zhuang": 739, "ying": 740, "sheng": 741, "lianmin": 742, "zheng": 743, "cody": 744, "hao": 745, "yu": 746, "joseph": 747, "gonzalez": 748, "zhang": 749, "ion": 750, "stoica": 751, "booktitle": 752, "proceedings": 753, "acm": 754, "sigops": 755, "29th": 756, "symposium": 757, "operating": 758, "systems": 759, "principles": 760, "year": 761, "contact": 762, "start": 763, "technical": 764, "feature": 765, "fellow": 766, "disclosures": 767, "advisories": 768, "partnerships": 769, "lists": 770, "mailto": 771, "end": 772, "kit": 773, "wish": 774, "refer": 775, "repo": 776, "releasing": 777, "releases": 778, "offer": 779, "reliable": 780, "base": 781, "packaged": 782, "binary": 783, "format": 784, "can": 785, "conveniently": 786, "accessed": 787, "pypi": 788, "serve": 789, "milestones": 790, "newly": 791, "improvements": 792, "upcoming": 793, "changes": 794, "affect": 795, "potential": 796, "breaking": 797, "versioning": 798, "uses": 799, "shifted": 800, "where": 801, "new": 802, "patch": 803, "every": 804, "weeks": 805, "contain": 806, "bug": 807, "fixes": 808, "opposed": 809, "semver": 810, "contains": 811, "only": 812, "backwards": 813, "critical": 814, "need": 815, "made": 816, "post1": 817, "_major_": 818, "milestone": 819, "incompatible": 820, "similar": 821, "_minor_": 822, "_patch_": 823, "_post1_": 824, "_patch": 825, "1_": 826, "either": 827, "implicit": 828, "cadence": 829, "bi": 830, "weekly": 831, "basis": 832, "days": 833, "after": 834, "same": 835, "branch": 836, "future": 837, "dates": 838, "below": 839, "tentative": 840, "optional": 841, "date": 842, "versions": 843, "jan": 844, "feb": 845, "mar": 846, "apr": 847, "jun": 848, "jul": 849, "13": 850, "aug": 851, "14": 852, "15": 853, "sep": 854, "16": 855, "17": 856, "oct": 857, "18": 858, "19": 859, "nov": 860, "21": 861, "dec": 862, "22": 863, "each": 864, "built": 865, "dedicated": 866, "cut": 867, "performed": 868, "before": 869, "previously": 870, "reused": 871, "builds": 872, "triggered": 873, "push": 874, "rc": 875, "tag": 876, "vx": 877, "rc1": 878, "enables": 879, "test": 880, "multiple": 881, "rcs": 882, "final": 883, "does": 884, "trigger": 885, "used": 886, "notes": 887, "monitor": 888, "reverts": 889, "apply": 890, "cherry": 891, "pick": 892, "criteria": 893, "approach": 894, "finalizing": 895, "clear": 896, "picks": 897, "process": 898, "land": 899, "pr": 900, "typically": 901, "ensure": 902, "sufficient": 903, "complete": 904, "thorough": 905, "round": 906, "stable": 907, "regression": 908, "functional": 909, "performance": 910, "against": 911, "recent": 912, "severe": 913, "issue": 914, "silent": 915, "incorrectness": 916, "compatibility": 917, "crashes": 918, "deadlocks": 919, "leaks": 920, "introduced": 921, "specific": 922, "change": 923, "identifiers": 924, "ci": 925, "work": 926, "prs": 927, "merged": 928, "trunk": 929, "exception": 930, "manual": 931, "validations": 932, "e2e": 933, "validation": 934, "perform": 935, "regressions": 936, "benchmark": 937, "workflow": 938, "workflows": 939, "yml": 940, "current": 941, "coverage": 942, "llama3": 943, "llama4": 944, "hardware": 945, "h100": 946, "mi300x": 947, "_note": 948, "based": 949, "availability_": 950, "step": 951, "access": 952, "request": 953, "repository": 954, "run": 955, "review": 956, "setup": 957, "familiarize": 958, "yourself": 959, "configurations": 960, "tree": 961, "benchmarks": 962, "rocm": 963, "navigate": 964, "configure": 965, "set": 966, "v0": 967, "commit": 968, "hash": 969, "results": 970, "once": 971, "completes": 972, "dashboard": 973, "hud": 974, "reponame": 975, "2fvllm": 976, "corresponding": 977, "comparison": 978, "compare": 979, "verify": 980, "occurred": 981, "example": 982, "vs": 983, "starttime": 984, "thu": 985, "2c": 986, "2017": 987, "20apr": 988, "202025": 989, "2021": 990, "3a43": 991, "3a50": 992, "20gmt": 993, "stoptime": 994, "wed": 995, "2016": 996, "20jul": 997, "granularity": 998, "week": 999, "lbranch": 1000, "lcommit": 1001, "b6553be1bc75f046b00046a4ad7576364d03c835": 1002, "rbranch": 1003, "rcommit": 1004, "a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f": 1005, "benchmarkname": 1006, "modelname": 1007, "20models": 1008, "backendname": 1009, "20backends": 1010, "modename": 1011, "20modes": 1012, "dtypename": 1013, "20dtype": 1014, "devicename": 1015, "20devices": 1016, "archname": 1017, "20platforms": 1018, "ctypes": 1019, "importlib": 1020, "util": 1021, "json": 1022, "logging": 1023, "os": 1024, "re": 1025, "shutil": 1026, "subprocess": 1027, "sys": 1028, "pathlib": 1029, "path": 1030, "packaging": 1031, "parse": 1032, "setuptools": 1033, "extension": 1034, "command": 1035, "build_ext": 1036, "setuptools_scm": 1037, "get_version": 1038, "utils": 1039, "cpp_extension": 1040, "cuda_home": 1041, "rocm_home": 1042, "def": 1043, "load_module_from_path": 1044, "module_name": 1045, "spec": 1046, "spec_from_file_location": 1047, "module": 1048, "module_from_spec": 1049, "modules": 1050, "loader": 1051, "exec_module": 1052, "return": 1053, "root_dir": 1054, "__file__": 1055, "parent": 1056, "logger": 1057, "getlogger": 1058, "__name__": 1059, "cannot": 1060, "envs": 1061, "directly": 1062, "because": 1063, "depends": 1064, "installed": 1065, "yet": 1066, "py": 1067, "vllm_target_device": 1068, "platform": 1069, "startswith": 1070, "darwin": 1071, "cpu": 1072, "automatically": 1073, "due": 1074, "macos": 1075, "elif": 1076, "linux": 1077, "wsl": 1078, "building": 1079, "so": 1080, "able": 1081, "correctly": 1082, "empty": 1083, "none": 1084, "getenv": 1085, "fallback": 1086, "main_cuda_version": 1087, "is_sccache_available": 1088, "bool": 1089, "sccache": 1090, "int": 1091, "vllm_disable_sccache": 1092, "is_ccache_available": 1093, "ccache": 1094, "is_ninja_available": 1095, "ninja": 1096, "is_url_available": 1097, "url": 1098, "str": 1099, "urllib": 1100, "urlopen": 1101, "try": 1102, "except": 1103, "false": 1104, "200": 1105, "class": 1106, "cmakeextension": 1107, "__init__": 1108, "self": 1109, "name": 1110, "cmake_lists_dir": 1111, "kwa": 1112, "super": 1113, "sources": 1114, "py_limited_api": 1115, "true": 1116, "abspath": 1117, "cmake_build_ext": 1118, "dict": 1119, "directories": 1120, "been": 1121, "configured": 1122, "did_config": 1123, "determine": 1124, "number": 1125, "compilation": 1126, "jobs": 1127, "optionally": 1128, "nvcc": 1129, "compile": 1130, "threads": 1131, "compute_num_jobs": 1132, "num_jobs": 1133, "max_jobs": 1134, "variable": 1135, "defined": 1136, "info": 1137, "sched_getaffinity": 1138, "isn": 1139, "universally": 1140, "fall": 1141, "back": 1142, "cpu_count": 1143, "error": 1144, "len": 1145, "attributeerror": 1146, "nvcc_threads": 1147, "_is_cuda": 1148, "get_nvcc_cuda_version": 1149, "reduce": 1150, "avoid": 1151, "overloading": 1152, "system": 1153, "max": 1154, "cmake": 1155, "configuration": 1156, "ext": 1157, "ve": 1158, "already": 1159, "cmakelists": 1160, "exit": 1161, "early": 1162, "select": 1163, "type": 1164, "optimization": 1165, "debug": 1166, "default_cfg": 1167, "relwithdebinfo": 1168, "cfg": 1169, "cmake_build_type": 1170, "cmake_args": 1171, "dcmake_build_type": 1172, "dvllm_target_device": 1173, "verbose": 1174, "dcmake_verbose_makefile": 1175, "dcmake_c_compiler_launcher": 1176, "dcmake_cxx_compiler_launcher": 1177, "dcmake_cuda_compiler_launcher": 1178, "dcmake_hip_compiler_launcher": 1179, "pass": 1180, "python": 1181, "executable": 1182, "exact": 1183, "match": 1184, "dvllm_python_executable": 1185, "reuse": 1186, "dependencies": 1187, "subsequent": 1188, "calls": 1189, "dvllm_python_path": 1190, "override": 1191, "directory": 1192, "fetchcontent": 1193, "downloads": 1194, "root": 1195, "deps": 1196, "allows": 1197, "between": 1198, "profiles": 1199, "plays": 1200, "nicely": 1201, "fetchcontent_base_dir": 1202, "fc_base_dir": 1203, "environ": 1204, "dfetchcontent_base_dir": 1205, "tool": 1206, "num_job": 1207, "dnvcc_threads": 1208, "build_tool": 1209, "dcmake_job_pool_compile": 1210, "string": 1211, "dcmake_job_pools": 1212, "default": 1213, "whatever": 1214, "sure": 1215, "dcmake_cuda_compiler": 1216, "bin": 1217, "check_call": 1218, "cwd": 1219, "build_temp": 1220, "build_extensions": 1221, "present": 1222, "working": 1223, "check_output": 1224, "oserror": 1225, "raise": 1226, "runtimeerror": 1227, "create": 1228, "exist": 1229, "exists": 1230, "makedirs": 1231, "targets": 1232, "target_name": 1233, "removeprefix": 1234, "vllm_flash_attn": 1235, "extensions": 1236, "append": 1237, "build_args": 1238, "target": 1239, "libraries": 1240, "proper": 1241, "location": 1242, "outdir": 1243, "get_ext_fullpath": 1244, "absolute": 1245, "skip": 1246, "directo": 1247, "ry": 1248, "continue": 1249, "appends": 1250, "range": 1251, "count": 1252, "should": 1253, "actually": 1254, "components": 1255, "install_args": 1256, "component": 1257, "standard": 1258, "copy": 1259, "build_lib": 1260, "included": 1261, "editable": 1262, "files": 1263, "recursive": 1264, "dst_file": 1265, "split": 1266, "copying": 1267, "dirname": 1268, "exist_ok": 1269, "copy_file": 1270, "precompiled_build_ext": 1271, "disables": 1272, "precompiled": 1273, "binaries": 1274, "assert": 1275, "vllm_use_precompiled": 1276, "skipping": 1277, "precompiled_wheel_utils": 1278, "extracts": 1279, "existing": 1280, "staticmethod": 1281, "extract_precompiled_and_patch_package": 1282, "wheel_url_or_path": 1283, "tempfile": 1284, "zipfile": 1285, "temp_dir": 1286, "isfile": 1287, "wheel_filename": 1288, "mkdtemp": 1289, "wheels": 1290, "wheel_path": 1291, "downloading": 1292, "urlretrieve": 1293, "filename": 1294, "package_data_patch": 1295, "files_to_copy": 1296, "_c": 1297, "abi3": 1298, "_moe_c": 1299, "_flashmla_c": 1300, "_vllm_fa2_c": 1301, "_vllm_fa3_c": 1302, "cumem_allocator": 1303, "compiled_regex": 1304, "file_members": 1305, "filter": 1306, "filelist": 1307, "extract": 1308, "target_path": 1309, "target_pa": 1310, "wb": 1311, "dst": 1312, "copyfileobj": 1313, "pkg": 1314, "replace": 1315, "setdefault": 1316, "basename": 1317, "finally": 1318, "removing": 1319, "rmtree": 1320, "get_base_commit_in_main_branch": 1321, "force": 1322, "nightly": 1323, "mainly": 1324, "vllm_test_use_precompiled_nightly_wheel": 1325, "upstream": 1326, "resp_json": 1327, "curl": 1328, "repos": 1329, "decode": 1330, "utf": 1331, "upstream_main_commit": 1332, "loads": 1333, "sha": 1334, "docker": 1335, "context": 1336, "git": 1337, "immutable": 1338, "missing": 1339, "vllm_docker_build_context": 1340, "local": 1341, "cat": 1342, "calledprocesserror": 1343, "fetch": 1344, "remote": 1345, "update": 1346, "branches": 1347, "ensures": 1348, "ref": 1349, "its": 1350, "history": 1351, "current_branch": 1352, "show": 1353, "base_commit": 1354, "merge": 1355, "valueerror": 1356, "err": 1357, "failed": 1358, "dev": 1359, "_no_device": 1360, "has_cuda": 1361, "_is_neuron": 1362, "_is_tpu": 1363, "_is_hip": 1364, "_is_cpu": 1365, "_is_xpu": 1366, "xpu": 1367, "_build_custom_ops": 1368, "get_rocm_version": 1369, "librocm": 1370, "core": 1371, "blob": 1372, "d11f5c20d500f729c393680a01fa902ebf92094b": 1373, "rocm_version": 1374, "cpp": 1375, "l21": 1376, "librocm_core_file": 1377, "lib": 1378, "is_file": 1379, "librocm_core": 1380, "cdll": 1381, "vererrors": 1382, "c_uint32": 1383, "get_rocm_core_version": 1384, "getrocmversion": 1385, "restype": 1386, "argtypes": 1387, "pointer": 1388, "minor": 1389, "byref": 1390, "get_neuronxcc_version": 1391, "sysconfig": 1392, "site_dir": 1393, "get_paths": 1394, "purelib": 1395, "version_file": 1396, "neuronxcc": 1397, "executed": 1398, "successfully": 1399, "fp": 1400, "content": 1401, "read": 1402, "regular": 1403, "__version__": 1404, "group": 1405, "output": 1406, "apex": 1407, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 1408, "nvcc_output": 1409, "universal_newlines": 1410, "release_idx": 1411, "nvcc_cuda_version": 1412, "get_gaudi_sw_version": 1413, "returns": 1414, "driver": 1415, "enable": 1416, "console": 1417, "printing": 1418, "hl": 1419, "smi": 1420, "shell": 1421, "capture_output": 1422, "env": 1423, "enable_console": 1424, "returncode": 1425, "stdout": 1426, "get_vllm_version": 1427, "write_to": 1428, "_version": 1429, "might": 1430, "cuda_version": 1431, "cuda_version_str": 1432, "tarball": 1433, "required": 1434, "sdist": 1435, "argv": 1436, "cu": 1437, "neuron_version": 1438, "neuron_version_str": 1439, "unknown": 1440, "runtime": 1441, "get_requirements": 1442, "package": 1443, "requirements_dir": 1444, "_read_requirements": 1445, "resolved_requirements": 1446, "cuda_major": 1447, "cuda_minor": 1448, "modified_requirements": 1449, "req": 1450, "flash": 1451, "attn": 1452, "unsupported": 1453, "ext_modules": 1454, "_rocm_c": 1455, "fa3": 1456, "requires": 1457, "later": 1458, "doesn": 1459, "produce": 1460, "targeting": 1461, "hopper": 1462, "package_data": 1463, "typed": 1464, "model_executor": 1465, "layers": 1466, "fused_moe": 1467, "configs": 1468, "wheel_location": 1469, "vllm_precompiled_wheel_location": 1470, "wheel_url": 1471, "cp38": 1472, "manylinux1_x86_64": 1473, "whl": 1474, "resp": 1475, "warn": 1476, "falling": 1477, "items": 1478, "extend": 1479, "cmdclass": 1480, "static": 1481, "metadata": 1482, "rather": 1483, "go": 1484, "install_requires": 1485, "extras_require": 1486, "bench": 1487, "pandas": 1488, "datasets": 1489, "tensorizer": 1490, "fastsafetensors": 1491, "runai": 1492, "streamer": 1493, "s3": 1494, "boto3": 1495, "audio": 1496, "librosa": 1497, "soundfile": 1498, "mistral_common": 1499, "processing": 1500, "video": 1501, "kept": 1502, "updated": 1503, "together": 1504, "dockerfile": 1505, "policy": 1506, "reporting": 1507, "report": 1508, "privately": 1509, "vulnerability": 1510, "submission": 1511, "form": 1512, "triage": 1513, "reports": 1514, "triaged": 1515, "vulnerability_management": 1516, "threat": 1517, "guide": 1518, "usage": 1519, "assumptions": 1520, "recommendations": 1521, "securely": 1522, "severity": 1523, "risk": 1524, "taking": 1525, "dealing": 1526, "past": 1527, "defaults": 1528, "cases": 1529, "categories": 1530, "vulnerabilities": 1531, "allow": 1532, "attackers": 1533, "execute": 1534, "arbitrary": 1535, "control": 1536, "significantly": 1537, "compromise": 1538, "confidentiality": 1539, "integrity": 1540, "privileges": 1541, "needed": 1542, "network": 1543, "deserialization": 1544, "exploit": 1545, "chains": 1546, "generally": 1547, "rated": 1548, "cvss": 1549, "flaws": 1550, "elevated": 1551, "rce": 1552, "contexts": 1553, "significant": 1554, "loss": 1555, "require": 1556, "advanced": 1557, "conditions": 1558, "some": 1559, "trust": 1560, "modes": 1561, "node": 1562, "privileged": 1563, "scores": 1564, "moderate": 1565, "cause": 1566, "denial": 1567, "service": 1568, "partial": 1569, "disruption": 1570, "do": 1571, "breach": 1572, "rating": 1573, "low": 1574, "informational": 1575, "errors": 1576, "non": 1577, "exploitable": 1578, "weaknesses": 1579, "privilege": 1580, "negligible": 1581, "side": 1582, "collisions": 1583, "often": 1584, "less": 1585, "than": 1586, "prenotification": 1587, "certain": 1588, "prenotify": 1589, "vendors": 1590, "ship": 1591, "purpose": 1592, "coordinated": 1593, "notification": 1594, "adding": 1595, "contacts": 1596, "advisory": 1597, "few": 1598, "added": 1599, "send": 1600, "vendor": 1601, "analyzed": 1602, "case": 1603, "withdraw": 1604, "receiving": 1605, "prenotifications": 1606, "membership": 1607, "refinements": 1608, "who": 1609, "traceback": 1610, "typing": 1611, "callable": 1612, "unittest": 1613, "mock": 1614, "find_cuda_init": 1615, "fn": 1616, "object": 1617, "helper": 1618, "function": 1619, "initialization": 1620, "initializes": 1621, "prints": 1622, "stack": 1623, "trace": 1624, "happens": 1625, "_lazy_init": 1626, "wrapper": 1627, "nonlocal": 1628, "extract_stack": 1629, "initialized": 1630, "format_list": 1631, "__main__": 1632, "import_module": 1633, "itertools": 1634, "jinja2": 1635, "file_head": 1636, "auto": 1637, "generated": 1638, "generate": 1639, "clang": 1640, "off": 1641, "kernel": 1642, "marlin_template": 1643, "namespace": 1644, "marlin_namespace_name": 1645, "template": 1646, "__global__": 1647, "void": 1648, "marlin": 1649, "scalar_t": 1650, "w_type_id": 1651, "s_type_id": 1652, "thread_m_blocks": 1653, "thread_n_blocks": 1654, "thread_k_blocks": 1655, "m_block_size_8": 1656, "stages": 1657, "group_blocks": 1658, "is_zp_float": 1659, "marlin_kernel_params": 1660, "point": 1661, "ku8": 1662, "don": 1663, "add": 1664, "scalar_types": 1665, "ku4": 1666, "ku4b8": 1667, "ku8b128": 1668, "kfe4m3fn": 1669, "kfe2m1f": 1670, "thread_configs": 1671, "128": 1672, "256": 1673, "64": 1674, "channelwise": 1675, "group_size": 1676, "dtypes": 1677, "fp16": 1678, "bf16": 1679, "remove_old_kernels": 1680, "kernel_": 1681, "call": 1682, "rm": 1683, "generate_new_kernels": 1684, "scalar_type": 1685, "dtype": 1686, "product": 1687, "all_template_str_list": 1688, "m_blocks": 1689, "small": 1690, "batch": 1691, "nvfp4": 1692, "mxfp4": 1693, "32": 1694, "methods": 1695, "k_blocks": 1696, "n_blocks": 1697, "c_dtype": 1698, "half": 1699, "nv_bfloat16": 1700, "is_zp_float_list": 1701, "hqq": 1702, "4bit": 1703, "group_b": 1704, "locks": 1705, "s_type": 1706, "kfe8m0fnu": 1707, "safely": 1708, "dequantize": 1709, "e8m0": 1710, "kfloat16": 1711, "kbfloat16": 1712, "template_str": 1713, "render": 1714, "pipe_stages": 1715, "file_content": 1716, "cutlass": 1717, "epilogues": 1718, "introduction": 1719, "document": 1720, "describes": 1721, "implemented": 1722, "fusing": 1723, "de": 1724, "operations": 1725, "onto": 1726, "gemms": 1727, "currently": 1728, "symmetric": 1729, "weights": 1730, "asymmetric": 1731, "activations": 1732, "quantized": 1733, "per": 1734, "token": 1735, "scaledepilogue": 1736, "bias": 1737, "scaledepiloguebias": 1738, "scaledepilogueazp": 1739, "scaledepilogueazppertoken": 1740, "instead": 1741, "passed": 1742, "epilogue": 1743, "induces": 1744, "redundant": 1745, "addition": 1746, "operation": 1747, "underlying": 1748, "linear": 1749, "algebra": 1750, "activation": 1751, "rfc": 1752, "3975": 1753, "widehat": 1754, "matrices": 1755, "become": 1756, "math": 1757, "s_a": 1758, "j_a": 1759, "z_a": 1760, "s_b": 1761, "gemm": 1762, "scales": 1763, "respectively": 1764, "matrix": 1765, "ones": 1766, "dimensions": 1767, "additional": 1768, "expanding": 1769, "further": 1770, "calculate": 1771, "follows": 1772, "left": 1773, "known": 1774, "ahead": 1775, "row": 1776, "equal": 1777, "mathbf": 1778, "vector": 1779, "column": 1780, "sums": 1781, "computes": 1782, "meaning": 1783, "parameters": 1784, "scale_a": 1785, "scalar": 1786, "scale_b": 1787, "always": 1788, "term": 1789, "precomputed": 1790, "stored": 1791, "azp_with_adj": 1792, "points": 1793, "efficiently": 1794, "must": 1795, "precompute": 1796, "above": 1797, "means": 1798, "becomes": 1799, "outer": 1800, "azp_adj": 1801, "adjustment": 1802, "azp": 1803, "performs": 1804, "computation": 1805, "dq": 1806, "collections": 1807, "abc": 1808, "iterable": 1809, "deepcopy": 1810, "dataclasses": 1811, "dataclass": 1812, "fields": 1813, "functools": 1814, "union": 1815, "yapf": 1816, "conflicts": 1817, "isort": 1818, "block": 1819, "vllm_cutlass_library_extension": 1820, "datatype": 1821, "epiloguescheduletag": 1822, "epiloguescheduletype": 1823, "mixedinputkernelscheduletype": 1824, "tileschedulertag": 1825, "tileschedulertype": 1826, "vllmdatatype": 1827, "vllmdatatypenames": 1828, "vllmdatatypesize": 1829, "vllmdatatypetag": 1830, "vllmdatatypetorchdatatypetag": 1831, "vllmdatatypevllmscalartypetag": 1832, "vllmkernelscheduletag": 1833, "dispatch_template": 1834, "machete_mm_launcher": 1835, "cuh": 1836, "machete": 1837, "impl_config": 1838, "impl_configs": 1839, "type_sig": 1840, "gen_type_sig": 1841, "types": 1842, "schedules": 1843, "extern": 1844, "impl_": 1845, "_sch_": 1846, "gen_sch_sig": 1847, "mmargs": 1848, "endfor": 1849, "mm_dispatch_": 1850, "args": 1851, "maybe_unused": 1852, "maybe_schedule": 1853, "cond": 1854, "heuristic": 1855, "endif": 1856, "torch_check_not_implemented": 1857, "machete_gemm": 1858, "schedule": 1859, "inline": 1860, "std": 1861, "scalartype": 1862, "maybe_scalartype": 1863, "const": 1864, "nullopt": 1865, "mm_dispatch": 1866, "out_type": 1867, "maybe_out_type": 1868, "value_or": 1869, "a_type": 1870, "maybe_g_scales_type": 1871, "maybe_group_scales": 1872, "maybe_g_zeros_type": 1873, "maybe_group_zeros": 1874, "maybe_ch_scales_type": 1875, "maybe_channel_scales": 1876, "maybe_tok_scales_type": 1877, "maybe_token_scales": 1878, "b_type": 1879, "vllmscalartypetag": 1880, "torchtypetag": 1881, "b_group_scale": 1882, "b_group_zeropoint": 1883, "b_channel_scale": 1884, "a_token_scale": 1885, "machete_mm": 1886, "with_group_scale_type": 1887, "tostring": 1888, "with_group_zeropoint_type": 1889, "with_channel_scale_type": 1890, "with_token_scale_type": 1891, "gen_type_option_name": 1892, "supported_schedules_dispatch": 1893, "supportedschedulesargs": 1894, "schs": 1895, "maybe_group_scales_type": 1896, "maybe_group_zeros_type": 1897, "last": 1898, "impl_template": 1899, "sch": 1900, "unique_schedules": 1901, "sch_sig": 1902, "struct": 1903, "sch_": 1904, "tileshapenm": 1905, "shape": 1906, "to_cute_constant": 1907, "tile_shape_mn": 1908, "clustershape": 1909, "cluster_shape_mnk": 1910, "todo": 1911, "reimplement": 1912, "kernelschedule": 1913, "kernelscheduletag": 1914, "kernel_schedule": 1915, "epilogueschedule": 1916, "epilogue_schedule": 1917, "tilescheduler": 1918, "tile_scheduler": 1919, "epiloguetiletype": 1920, "collective": 1921, "epiloguetileauto": 1922, "typename": 1923, "machetekerneltemplate": 1924, "datatypetag": 1925, "elementa": 1926, "elementb": 1927, "elementd": 1928, "accumulator": 1929, "groupscalet": 1930, "groupzerot": 1931, "channelscalet": 1932, "tokenscalet": 1933, "kerneltmawarpspecializedcooperative": 1934, "run_impl": 1935, "prepack_template": 1936, "machete_prepack_launcher": 1937, "prepack_b_dispatch": 1938, "prepackbargs": 1939, "convert_type": 1940, "unsigned_type_with_bitwidth": 1941, "b_num_bits": 1942, "size_bits": 1943, "convert": 1944, "prepack_impl": 1945, "prepackedlayoutbtemplate": 1946, "elementconvert": 1947, "layout": 1948, "columnmajor": 1949, "atype": 1950, "with_group_scales_type": 1951, "tmami": 1952, "tmawarpspecializedcooperative": 1953, "tmacoop": 1954, "frozen": 1955, "scheduleconfig": 1956, "tuple": 1957, "typeconfig": 1958, "prepacktypeconfig": 1959, "implconfig": 1960, "generate_sch_sig": 1961, "schedule_config": 1962, "tile_shape": 1963, "cluster_shape": 1964, "mostly": 1965, "unique": 1966, "shorter": 1967, "generate_terse_sch_sig": 1968, "kernel_terse_names_replace": 1969, "tmami_": 1970, "tmawarpspecializedcooperative_": 1971, "tmacoop_": 1972, "streamkscheduler": 1973, "streamk": 1974, "orig": 1975, "terse": 1976, "type_name": 1977, "generate_type_signature": 1978, "kernel_types": 1979, "getattr": 1980, "field": 1981, "generate_type_option_name": 1982, "b_": 1983, "with_": 1984, "_type": 1985, "is_power_of_two": 1986, "_to_cute_constant": 1987, "isinstance": 1988, "num_bits": 1989, "u4": 1990, "u8": 1991, "u16": 1992, "u32": 1993, "u64": 1994, "template_globals": 1995, "create_template": 1996, "globals": 1997, "mm_dispatch_template": 1998, "mm_impl_template": 1999, "prepack_dispatch_template": 2000, "create_sources": 2001, "num_impl_files": 2002, "machete_mm_dispatch": 2003, "prepack_types": 2004, "prepacked_type_key": 2005, "prepack_type": 2006, "seen": 2007, "shapes": 2008, "layouts": 2009, "vary": 2010, "way": 2011, "unique_prepack_types": 2012, "prepack_types_seen": 2013, "machete_prepack": 2014, "up": 2015, "impls": 2016, "across": 2017, "num_impls": 2018, "num_impls_per_file": 2019, "ceil": 2020, "files_impls": 2021, "curr_num_impls_assigned": 2022, "curr_impl_in_file": 2023, "curr_impl_configs": 2024, "reversed": 2025, "while": 2026, "room_left_in_file": 2027, "curr_ic": 2028, "break": 2029, "apart": 2030, "impl": 2031, "config": 2032, "tmp_ic": 2033, "pop": 2034, "part": 2035, "file_impls": 2036, "enumerate": 2037, "machete_mm_impl_part": 2038, "csrc": 2039, "readme": 2040, "codegeneration": 2041, "works": 2042, "script_dir": 2043, "sch_common_params": 2044, "condition": 2045, "default_tile_heuristic_config": 2046, "257": 2047, "16384": 2048, "4096": 2049, "129": 2050, "8192": 2051, "65": 2052, "4069": 2053, "12288": 2054, "33": 2055, "6144": 2056, "26624": 2057, "tuned": 2058, "h100s": 2059, "default_heuristic": 2060, "tile_config": 2061, "ignore": 2062, "get_unique_schedules": 2063, "deterministic": 2064, "ot": 2065, "herwise": 2066, "causes": 2067, "miss": 2068, "gptq_kernel_type_configs": 2069, "f32": 2070, "u4b8": 2071, "u8b128": 2072, "f16": 2073, "zip": 2074, "repeat": 2075, "awq_kernel_type_configs": 2076, "lucaswilkinson": 2077, "tuning": 2078, "qqq_tile_heuristic_config": 2079, "broken": 2080, "qqq": 2081, "investigate": 2082, "qqq_heuristic": 2083, "qqq_kernel_types": 2084, "s8": 2085, "s32": 2086, "e4m3": 2087, "output_dir": 2088, "delete": 2089, "separate": 2090, "filepath": 2091, "output_file": 2092, "rendered": 2093, "mixed": 2094, "precision": 2095, "spiritual": 2096, "successor": 2097, "architectures": 2098, "pairs": 2099, "easier": 2100, "compared": 2101, "overview": 2102, "effectively": 2103, "scale_type": 2104, "w_s": 2105, "compute_type": 2106, "w_q": 2107, "w_z": 2108, "weight": 2109, "zeropoints": 2110, "fma": 2111, "pre": 2112, "applied": 2113, "supplied": 2114, "assume": 2115, "subtracted": 2116, "prepacking": 2117, "closely": 2118, "allowing": 2119, "wider": 2120, "shared": 2121, "loading": 2122, "prepacked": 2123, "calling": 2124, "flow": 2125, "looks": 2126, "something": 2127, "_custom_ops": 2128, "ops": 2129, "w_q_packed": 2130, "machete_prepack_b": 2131, "wtype": 2132, "b_q": 2133, "b_scales": 2134, "b_group_size": 2135, "generation": 2136, "different": 2137, "tile": 2138, "instantiations": 2139, "appended": 2140, "assuming": 2141, "provide": 2142, "bundles": 2143, "specialization": 2144, "scheduler": 2145, "etc": 2146, "differently": 2147, "problem": 2148, "almost": 2149, "never": 2150, "one": 2151, "beneficial": 2152, "comes": 2153, "provided": 2154, "maps": 2155, "parameter": 2156, "define": 2157, "combinations": 2158, "with_zeropoints": 2159, "with_scales": 2160, "times": 2161, "limiting": 2162, "enum": 2163, "cutlass_library": 2164, "custom": 2165, "values": 2166, "enum_auto": 2167, "tmawarpspecialized": 2168, "tmawarpspecializedpingpong": 2169, "datatypenames": 2170, "vllm_uint4b8_t": 2171, "vllm_uint8b128_t": 2172, "datatypesize": 2173, "s4": 2174, "ks4": 2175, "ks8": 2176, "byte": 2177, "char": 2178, "float8_e4m3fn": 2179, "bfloat16": 2180, "float": 2181, "kernelscheduletype": 2182, "kerneltmawarpspecialized": 2183, "kerneltmawarpspecializedpingpong": 2184, "regex": 2185, "forbidden_import_re": 2186, "triton": 2187, "allowed_lines": 2188, "triton_utils": 2189, "tl": 2190, "allowed_files": 2191, "importing": 2192, "is_allowed_file": 2193, "current_file": 2194, "is_forbidden_import": 2195, "stripped": 2196, "parse_diff": 2197, "diff": 2198, "violations": 2199, "current_lineno": 2200, "skip_allowed_file": 2201, "splitlines": 2202, "next": 2203, "code_line": 2204, "get_diff": 2205, "diff_type": 2206, "staged": 2207, "cached": 2208, "unified": 2209, "unstaged": 2210, "all_violations": 2211, "diff_output": 2212, "stderr": 2213, "forbidden": 2214, "direct": 2215, "detected": 2216, "__future__": 2217, "annotations": 2218, "forbidden_patterns": 2219, "allowed_patterns": 2220, "get_staged_python_files": 2221, "result": 2222, "am": 2223, "endswith": 2224, "check_file": 2225, "encoding": 2226, "line_num": 2227, "unicodedecodeerror": 2228, "total_violations": 2229, "found": 2230, "noqa": 2231, "e501": 2232, "imports": 2233, "systemexit": 2234, "generates": 2235, "specialized": 2236, "script": 2237, "reads": 2238, "input": 2239, "splits": 2240, "two": 2241, "nightly_torch_test": 2242, "related": 2243, "torch_nightly_test": 2244, "packages": 2245, "input_file": 2246, "white": 2247, "dependency": 2248, "fails": 2249, "white_list": 2250, "torchaudio": 2251, "torchvision": 2252, "mamba_ssm": 2253, "skip_next": 2254, "multiprocessing": 2255, "truth": 2256, "importerror": 2257, "get_python_executable": 2258, "get_cpu_cores": 2259, "cores": 2260, "generate_presets": 2261, "output_path": 2262, "cmakeuserpresets": 2263, "attempting": 2264, "detect": 2265, "nvcc_path": 2266, "prospective_path": 2267, "nvcc_path_input": 2268, "usr": 2269, "python_executable": 2270, "python_executable_prompt": 2271, "virtual": 2272, "home": 2273, "venvs": 2274, "manually": 2275, "cpu_cores": 2276, "min": 2277, "cmake_jobs": 2278, "tools": 2279, "project_root": 2280, "resolvable": 2281, "isabs": 2282, "cache_variables": 2283, "cmake_cuda_compiler": 2284, "vllm_python_executable": 2285, "cmake_install_prefix": 2286, "sourcedir": 2287, "cmake_cuda_flags": 2288, "compiler": 2289, "cache": 2290, "launcher": 2291, "cxx": 2292, "cmake_": 2293, "_compiler_launcher": 2294, "configure_preset": 2295, "binarydir": 2296, "cachevariables": 2297, "generator": 2298, "cmake_job_pools": 2299, "slower": 2300, "presets": 2301, "sync": 2302, "cmakeminimumrequired": 2303, "26": 2304, "configurepresets": 2305, "buildpresets": 2306, "configurepreset": 2307, "output_file_path": 2308, "overwrite": 2309, "cancelled": 2310, "dump": 2311, "indent": 2312, "nto": 2313, "preset": 2314, "cd": 2315, "initialize": 2316, "writing": 2317, "pathspec": 2318, "pickle": 2319, "serial_utils": 2320, "executor": 2321, "multiproc_executor": 2322, "hasher": 2323, "transformers_utils": 2324, "registry": 2325, "tests": 2326, "utils_": 2327, "test_utils": 2328, "tokenization": 2329, "test_cached_tokenizer": 2330, "parallel_state": 2331, "engine": 2332, "client": 2333, "device_communicators": 2334, "custom_all_reduce_utils": 2335, "shm_broadcast": 2336, "graph_machete_bench": 2337, "benchmark_lora": 2338, "benchmark_machete": 2339, "fused_kernels": 2340, "layernorm_rms_benchmarks": 2341, "cutlass_benchmarks": 2342, "w8a8_benchmarks": 2343, "sparse_benchmarks": 2344, "cloudpickle": 2345, "worker": 2346, "worker_base": 2347, "mp_distributed_executor": 2348, "ray_distributed_executor": 2349, "entrypoints": 2350, "pickle_re": 2351, "sas": 2352, "is_python_file": 2353, "scan_file": 2354, "load_gitignore": 2355, "repo_root": 2356, "gitignore_path": 2357, "gitignore": 2358, "patterns": 2359, "from_lines": 2360, "gitwildmatch": 2361, "bad_files": 2362, "dirpath": 2363, "filenames": 2364, "walk": 2365, "abs_path": 2366, "rel_path": 2367, "relpath": 2368, "ignored": 2369, "match_file": 2370, "nerror": 2371, "nif": 2372, "intentional": 2373, "check_pickle_imports": 2374, "test_regex": 2375, "test_cases": 2376, "pkl": 2377, "cpkl": 2378, "dumps": 2379, "timport": 2380, "somethingelse": 2381, "pickleas": 2382, "asdf": 2383, "should_match": 2384, "expected": 2385, "got": 2386, "lazy": 2387, "appears": 2388, "type_checking": 2389, "guard": 2390, "short": 2391, "whitelist": 2392, "ast": 2393, "resolve": 2394, "init_path": 2395, "allowed_imports": 2396, "frozenset": 2397, "env_override": 2398, "allowed_from_modules": 2399, "_is_internal": 2400, "_fail": 2401, "disallowed": 2402, "eager": 2403, "lineno": 2404, "msg": 2405, "read_text": 2406, "visitor": 2407, "nodevisitor": 2408, "_in_type_checking": 2409, "visit_if": 2410, "guard_is_type_checking": 2411, "attribute": 2412, "attr": 2413, "prev": 2414, "child": 2415, "orelse": 2416, "generic_visit": 2417, "visit_import": 2418, "alias": 2419, "names": 2420, "inside": 2421, "visit_importfrom": 2422, "importfrom": 2423, "module_as_written": 2424, "docstring": 2425, "inspect": 2426, "get_attr_docs": 2427, "cls_node": 2428, "classdef": 2429, "docstrings": 2430, "placed": 2431, "assignments": 2432, "davidism": 2433, "mit": 2434, "license": 2435, "pairwise": 2436, "implement": 2437, "dropped": 2438, "iterator": 2439, "iter": 2440, "yield": 2441, "consider": 2442, "pair": 2443, "nodes": 2444, "assignment": 2445, "constant": 2446, "assign": 2447, "annassign": 2448, "expr": 2449, "doc": 2450, "cleandoc": 2451, "annotated": 2452, "assigning": 2453, "plain": 2454, "configvalidator": 2455, "visit_classdef": 2456, "validate": 2457, "decorators": 2458, "decorator_list": 2459, "func": 2460, "validate_class": 2461, "fail": 2462, "decorator": 2463, "class_node": 2464, "attr_docs": 2465, "stmt": 2466, "annotation": 2467, "classvar": 2468, "variables": 2469, "subscript": 2470, "field_name": 2471, "slice": 2472, "elts": 2473, "literal_args": 2474, "arg": 2475, "literal": 2476, "literal1": 2477, "literal2": 2478, "validate_ast": 2479, "validate_file": 2480, "file_path": 2481, "validating": 2482, "message": 2483, "summarize": 2484, "invoked": 2485, "syntax": 2486, "python3": 2487, "report_build_time_ninja": 2488, "typical": 2489, "longest": 2490, "steps": 2491, "weighted": 2492, "torch_bindings": 2493, "elapsed": 2494, "_attn_c": 2495, "dir": 2496, "31": 2497, "38": 2498, "linking": 2499, "flash_attn_c": 2500, "machete_mm_": 2501, "183": 2502, "185": 2503, "186": 2504, "37": 2505, "scaled_mm_c3x": 2506, "449": 2507, "43": 2508, "scaled_mm_c2x": 2509, "527": 2510, "344": 2511, "attention_": 2512, "1087": 2513, "1110": 2514, "10120": 2515, "sum": 2516, "1x": 2517, "134": 2518, "completed": 2519, "average": 2520, "argparse": 2521, "errno": 2522, "fnmatch": 2523, "defaultdict": 2524, "long": 2525, "long_count": 2526, "long_ext_count": 2527, "represents": 2528, "ninja_log": 2529, "creates": 2530, "passing": 2531, "seconds": 2532, "owner": 2533, "weighted_duration": 2534, "duration": 2535, "task": 2536, "setweightedduration": 2537, "sets": 2538, "weightedduration": 2539, "takes": 2540, "divides": 2541, "many": 2542, "tasks": 2543, "running": 2544, "thus": 2545, "approximate": 2546, "total": 2547, "serialized": 2548, "serializing": 2549, "ending": 2550, "much": 2551, "longer": 2552, "durations": 2553, "modest": 2554, "floating": 2555, "epsilon": 2556, "000002": 2557, "describetargets": 2558, "printable": 2559, "summarizes": 2560, "dozens": 2561, "handle": 2562, "sanely": 2563, "max_length": 2564, "chosen": 2565, "fit": 2566, "minimizing": 2567, "word": 2568, "wrapping": 2569, "readtargets": 2570, "log": 2571, "show_all": 2572, "log_file": 2573, "sorted": 2574, "objects": 2575, "header": 2576, "readline": 2577, "v5": 2578, "unrecognized": 2579, "targets_dict": 2580, "last_end_seen": 2581, "parts": 2582, "exe": 2583, "rudely": 2584, "halted": 2585, "corrupt": 2586, "silently": 2587, "cmdhash": 2588, "restart": 2589, "integral": 2590, "milliseconds": 2591, "1000": 2592, "earlier": 2593, "stamp": 2594, "possibly": 2595, "incremental": 2596, "throw": 2597, "away": 2598, "displayed": 2599, "independently": 2600, "comparing": 2601, "records": 2602, "commands": 2603, "guaranteed": 2604, "several": 2605, "however": 2606, "repeated": 2607, "changed": 2608, "stop": 2609, "identified": 2610, "reset": 2611, "dictionary": 2612, "getextension": 2613, "extra_patterns": 2614, "important": 2615, "canonical": 2616, "ultimately": 2617, "goal": 2618, "fn_pattern": 2619, "good": 2620, "grouping": 2621, "type_mappings": 2622, "capture": 2623, "javac": 2624, "jar": 2625, "distinguished": 2626, "interface": 2627, "ext1": 2628, "splitext": 2629, "ext2": 2630, "preserve": 2631, "pdb": 2632, "dll": 2633, "pefile": 2634, "grouped": 2635, "listed": 2636, "toc": 2637, "attempt": 2638, "identify": 2639, "identifying": 2640, "obj": 2641, "categorized": 2642, "mojo": 2643, "jars": 2644, "java": 2645, "normalize": 2646, "mojom": 2647, "summarizeentries": 2648, "entries": 2649, "extra_step_types": 2650, "beginning": 2651, "starting": 2652, "stopping": 2653, "exactly": 2654, "iterate": 2655, "keeping": 2656, "ends": 2657, "own": 2658, "easily": 2659, "calculated": 2660, "task_start_stop_times": 2661, "earliest": 2662, "total_cpu_time": 2663, "length": 2664, "weighted_total": 2665, "happen": 2666, "starts": 2667, "stops": 2668, "come": 2669, "alphabet": 2670, "making": 2671, "running_tasks": 2672, "record": 2673, "processed": 2674, "know": 2675, "deltas": 2676, "last_time": 2677, "accumulated": 2678, "last_weighted_time": 2679, "scan": 2680, "events": 2681, "action_name": 2682, "accumulate": 2683, "num_running": 2684, "running_": 2685, "moment": 2686, "ran": 2687, "del": 2688, "500": 2689, "possible": 2690, "untrustworthy": 2691, "3f": 2692, "entries_by_ext": 2693, "1f": 2694, "2f": 2695, "parser": 2696, "argumentparser": 2697, "add_argument": 2698, "dest": 2699, "build_directory": 2700, "help": 2701, "semicolon": 2702, "separated": 2703, "analyze": 2704, "_extra_args": 2705, "parse_known_args": 2706, "step_types": 2707, "room": 2708, "extra": 2709, "global": 2710, "enoent": 2711, "spdxstatus": 2712, "spdx": 2713, "enumeration": 2714, "missing_license": 2715, "copyright": 2716, "missing_copyright": 2717, "missing_both": 2718, "completely": 2719, "full_spdx_header": 2720, "identifier": 2721, "apache": 2722, "filecopyrighttext": 2723, "license_line": 2724, "copyright_line": 2725, "check_spdx_header_status": 2726, "shebang": 2727, "start_idx": 2728, "has_license": 2729, "has_copyright": 2730, "headers": 2731, "add_header": 2732, "supplement": 2733, "seek": 2734, "truncate": 2735, "writelines": 2736, "insert": 2737, "files_missing_both": 2738, "files_missing_copyright": 2739, "files_missing_license": 2740, "collect": 2741, "fixing": 2742, "all_files_to_fix": 2743, "cluster": 2744, "described": 2745, "http": 2746, "2412": 2747, "19437": 2748, "deploy": 2749, "sparse": 2750, "moe": 2751, "experts": 2752, "beyond": 2753, "normal": 2754, "impossible": 2755, "bundle": 2756, "down": 2757, "pplx": 2758, "ppl": 2759, "deepep": 2760, "necessary": 2761, "nvshmem": 2762, "ibgda": 2763, "host": 2764, "machine": 2765, "scripts": 2766, "accept": 2767, "positional": 2768, "argument": 2769, "workspace": 2770, "staging": 